{"articles":[{"authors":[{"isAgency":false,"name":"Sally Eccleston","type":"author","uri":"sally_eccleston@stokesentinel.co.uk"}],"body":"Get the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nTraders and families are calling for police to put the spotlight on beggars and rough sleepers during a week of action in their town centre.\n\nNeighbourhood officers have teamed up with organisations including the fire service and council in an effort to clamp down on anti-social behaviour and criminality in Stoke.\n\nPolice say that during the week of action specialist teams will be on hand to to give support and advice around drugs, alcohol, housing and employment. Officers have also promised there will be a 'number of law enforcement operations' as well.\n\nMeanwhile Stoke-on-Trent City Council's environmental crime unit will also be carrying out litter-picks and removing fly-tipping.\n\nAnd families along with business owners say begging is one of the current issues they would like to see addressed.\n\nResident Rachel Baker, aged 37, who lives in Stoke, said: \"In the morning, a lot of people come out of the Salvation Army shelter and find their spots to sit in for the rest of the day.\n\n\"But most of the time, you don't know who is genuine. You could see them one minute and then the next they've moved on.\n\n\"They don't have anywhere to go in the day and so they beg in the doorways, but it can put some people off coming into the town.\n\n\"I know there are efforts to combat this, but it always seems to be the same people that you see.\"\n\nTrader Mike Chorlton, from town centre-based Palfreyman's Carpet Centre said: \"You see a lot of rough sleepers in the doorways most mornings.\n\n\"I don't mind them sleeping in the doorway - if they'd ask. As long as they're gone for 7.15am when I come into work, I don't mind.\n\n\"But I don't like the mess they leave and when they're defecating in the doorway leaving needles behind.\n\n\"It does need to be sorted by a combined effort from the police and the council, but I don't know what the answer would be.\"\n\nDuring the action week a mobile police station will be based at Stoke Market on Wednesday and Friday and outside Sainsbury's on Thursday. It will be in place from 9.30am until 4pm.\n\nSergeant Steve Gibson says officers are on hand to listen to the concerns of the community. He said: \"The week of action allows people to access services including our rough sleeper team, crime prevention teams, drug and alcohol services and anti-social behaviour teams to tackle their concerns.\n\n\"Our officers will be providing an enhanced service in the town centre to get to the root causes of the problems found in the town.\"\n\nOfficers will also be working with the local schools, and organising street games with 'Sport Youth' workers.\n\nSgt Gibson added: \"We're delighted to be running another Week of Action which we hope will achieve positive results and promote community spirit, whilst providing a fantastic opportunity for residents to engage with us and tell us what matters most to them.\"\n\nRead More Top stories on StokeonTrentLive\n\nStaffordshire Fire and Rescue Service will also be checking homes are safe. Paul Marrow, community safety officer, said: \"This week, the fire service will be on hand to engage with the public and to pass on safety messages to ensure people are safe in their own homes.\n\n\"We can make Safe and Well appointments with them to make sure they have working smoke detectors and if anyone has any serious concerns, we'd go and sort it out.\"\n\nCouncillor Randy Conteh, cabinet member for housing, communities and safer city at the city council, said: \"This activity forms part of a wider partnership commitment between the city council, police and our partners to reduce crime and anti-social behaviour in Stoke town centre, and to promote community public safety in the area.\n\n\"It's all about providing reassurance and raising confidence with local businesses, the community and visitors. This is a really good opportunity for people to speak to a number of professionals who can give help, advice and support on a range of issues.\"\n\nWant to tell us about something going on where you live? Let us know - Tweet us @SOTLive or message us on our Facebook page . And if you have pictures to share, tag us on Instagram at StokeonTrentLive .","dataType":"news","date":"2019-03-20","dateTime":"2019-03-20T05:20:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2662420.ece/ALTERNATES/s1200/0_JS177835776.jpg","isDuplicate":false,"lang":"eng","sentiment":0.08235294117647052,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"05:20:00","title":"'You don't know who is genuine' - police urged to tackle beggars in town centre","uri":"1091612884","url":"https://www.stokesentinel.co.uk/news/stoke-on-trent-news/you-dont-know-who-genuine-2658581","wgt":5},{"authors":[{"isAgency":false,"name":"Keith Wales","type":"author","uri":"keith_wales@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid EmailI HAVE A DREAM\n\nNathan Jones has confessed he'd love a shot at managing Wales - but only after his work at Stoke City is done.\n\nThe 45-year-old Welshman says no-one would be prouder if he ever got the call to manage his country.\n\nBut he insists such ambitions are beyond the horizon as he continues to tackle the job that promises to define his entire career here at Stoke City.\n\nHe said: \"I want to manage at the highest level and I believe I'm on a pathway and taken calculated risks and gambles with my career... from assistant manager to a development coach to assistant manager to manager and now managing this great club.\n\n\"It would be something that would interest me, but don't take that out of context because I am very proud of my job here and I hope I'm here for a very long time.\"\n\nSTOKE OLD BOY'S TALE OF WOE\n\nLouis Moult has opened up for the first time about his binge drinking and trying to cope with the loss of his mum in his teens.\n\nNow 26, the Penkhull-born footballer, who came through the ranks at Stoke and left in 2012, says talking over problems can be the best way of coping with them.\n\nInstead, he turned to drink to drown his sorrows and he admits it could have cost him everything.\n\nSpeaking to the Mail during a visit to a centre for vulnerable adults in Preston, Moult movingly re-lived his school days when his alcoholic mother lost her battle for life.\n\n\"I just locked myself in my room. My dad worked so I would pretend to get ready for school and then just get back in my bed and shut off from the world.\"\n\nSETBACK FOR STOKE STAR\n\nStoke City striker Sam Vokes is out of Wales' friendly against Trinidad & Tobago tonight.\n\nNational boss Ryan Giggs says the January recruit aggravated an injury during his return to action for Stoke at the weekend.\n\nVokes, who was first injured shortly after scoring against Aston Villa on February 23, returned against Reading at the weekend but looked rusty and was eventually subbed on 70 minutes.\n\nGiggs said: \"Vokes has been struggling with a groin problem. He came back at the weekend, played and then just felt it again, so he is unavailable.\"\n\nTHE PRICE OF FAILURE\n\nClubs across the Championship will be keeping a close eye on Bolton Wanderers' fate in the next few days as it could significantly affect how their season plans out.\n\nA winding-up petition is due to be heard at the High Court on Wednesday, with Bolton facing administration or a 12-point deduction after a proposed takeover from a Cheshire-based consortium fell through.\n\nBolton going out of business immediately is an unlikely scenario, but should it occur it would send shockwaves through the rest of the division.\n\nWigan, having recently beaten Bolton, would be one of the biggest movers as they would slip from 19th in the standings to 22nd - while Derby County would benefit the most. And then there is Stoke City.\n\nBORN TO BE BADOU\n\nIt seems Badou Ndiaye will soon be joining the likes of Giannelli Imbula and Kevin Wimmer as big-money signings Stoke City no longer want but are unable to move on.\n\nAccording to the Turkish media, the Senegal international is poised to return to the bet365 Stadium in the summer since cash-strapped loan club Galatasaray can't pay the €16m to €17m Stoke are said to want for him.\n\nBut Ndiaye's indifferent form for the Super Lig champions means they are also unlikely to enter into another loan for the 28-year-old and are looking elsewhere for midfield assets for next season.\n\nNdiaye joined Stoke from Galatasaray for around £13.5m in January of last year on a contract that runs until the summer of 2022.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away UP NEXT\n\nStoke City v Sheffield Wednesday, 3pm, Saturday, March 30, Championship, bet365 Stadium\n\nStoke played some of their most fluent football under Gary Rowett as they stormed into a two-goal lead in the reverse fixture at Hillsborough last September. But they then showed the frailties that would become all too familiar as the season progressed to allow the Owls to fight back and claim a 2-2 draw.\n\nBoth Stoke and Wednesday now have new managers in Nathan Jones and Steve Bruce, while the Owls are 10th in the Championship table and Stoke are down in 16th. Both teams are also on lengthy unbeaten runs - 11 games for the visitors and seven for the Potters. A 0-0 draw anybody?\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-20","dateTime":"2019-03-20T04:34:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2656379.ece/ALTERNATES/s1200/0_nathan-jones-v-reading.jpg","isDuplicate":false,"lang":"eng","sentiment":0.192156862745098,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"04:34:00","title":"Stoke City boss dreams of top job but Bolton decision could cost Potters dear","uri":"1091591910","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-wales-nathan-jones-ndiaye-2665014","wgt":5},{"authors":[],"body":"Aside from passing on deals for two young players named Demba Ba and Romelu Lukaku, the Potters also completed several deals they'd probably quite like to forget.\n\nStoke arrived in the Premier League as underdogs and were tipped to suffer immediate relegation.\n\nTony Pulis moved quickly to build the rigid, defensive style Stoke would become famous for but one of his early defensive recruits Ibrahima Sonko was one of his worst in his tenure.\n\nAt £2.7m, Sonko was one of the Potters' most expensive signings at the time, with only two other recruits arriving in the same window trumping that figure. He was unable to replicate the success he'd had with Reading though, and quickly fell out of favour at Stoke.\n\nFollowing a rocky start to life, Sonko scythed down Morten Gamst Pedersen for a penalty as Stoke fell to a heavy defeat to Blackburn. Pulis described the tackle as 'abysmal defending' in his post-match interview and Sonko never started for Stoke again.\n\nHe was allowed to leave on loan the following summer and was eventually released by the club after they failed to find a buyer.","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T22:09:00Z","eventUri":null,"image":"https://images2.minutemediacdn.com/image/upload/c_fill,w_1200,h_630,f_auto,q_auto,g_auto/shape/cover/sport/chelsea-v-stoke-city-premier-league-5c8d1743ba5856add2000001.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.207843137254902,"sim":0,"source":{"dataType":"news","title":"90min.com","uri":"90min.com"},"time":"22:09:00","title":"The 11 Worst Stoke City Signings of the Premier League Era","uri":"1091424278","url":"https://www.90min.com/posts/6321444-the-11-worst-stoke-city-signings-of-the-premier-league-era","wgt":5},{"authors":[{"isAgency":false,"name":"Daniel Chipperfield","type":"author","uri":"daniel_chipperfield@bristolpost.co.uk"}],"body":"Get the biggest Daily stories by emailSubscribeSee our privacy noticeMore newslettersThank you for subscribingWe have more newslettersShow meSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nTwo fast-food drive-thrus planned for Bradley Stoke have been refused for a second time.\n\nA new high-level planning committee has rejected plans for a McDonald's and Starbucks in the town centre after they were refused by a development management committee last month.\n\nThe spatial planning committee threw out the plans on March 19 despite the developer agreeing to reduced opening hours and other conditions in a bid to overcome councillors' objections.\n\nThe developer could appeal today's decision.\n\nBrookmaker Limited Partnership had wanted to build 24-hour, drive-thru McDonald's and Starbucks outlets at the far end of the car park of the Willow Brook Centre.\n\nThose plans were rejected in February over fears they would lead to an increase in noise, pollution, and antisocial behaviour, and objections to the concentration of eateries around the centre.\n\nThe developer subsequently agreed to opening hours of 6am to 11pm for Starbucks, and 6am to midnight or 1am, depending on the day of the week, for McDonald's.\n\nBut during today's reassessment, Karen Pullen, who has lived near the Willow Brook Centre for many years, told the spatial planning committee that \"no amount of conditions\" would be able to lessen the detrimental effect on the community.\n\nA spokesman for the developer told the committee that the scheme, which also included extensions to the shopping centre, was a \"significant investment\" in the town centre that would create more than 85 jobs.\n\nBut councillors and members of the public lined up to express their objections, which focused on noise, litter, traffic, pollution and parking.\n\nSteve Moir, the head teacher of Bradley Stoke Community School, appealed to the committee to reject the application to spare children from obesity.\n\nRead More Where THE places to live are in Bristol\n\n\"We know how powerful and influential the advertising campaigns of international fast-food chains are,\" he said. \"If we do not get this right, for many of those young people now, we are condemning them to a lifetime of weight issues.\"\n\nConservative councillor for Bradley Stoke South, Roger Avenin, said the town was already \"overwhelmed\" by food outlets.\n\nConservative councillor for Stoke Gifford, Keith Cranney, added that residents had been promised \"quality retail shops\" in the town centre.\n\nCommittee member Pat Hockey, Liberal Democrat councillor for Frampton Cotterell, said she found the plans distressing given that Bradley Stoke had finally got a \"reasonable\" town centre after a long history of planning \"problems\".\n\n\"It really grieves me to see that what I think is going to be really out of place in the town centre and is going to affect the local residents that are near it,\" she said.\n\nA planning officer told the committee that, while she sympathised with some of the objections, the council had limited powers to limit the number of fast-food restaurants and that there were no legal or planning reasons for rejecting the application.\n\nThe nine-strong spatial planning committee rejected the application by a majority of eight. Conservative councillor for Thornbury North, David Chubb, abstained from voting.\n\nMembers refused the application for the same reasons as the development management committee, adding that the plans did not meet the economic, social or environmental objectives of sustainable development under the National Planning Policy Framework.\n\nBecause council officers had originally recommended the plans for approval, they were referred to the spatial planning committee for a second assessment in the first test of South Gloucestershire Council's new two-tier planning system.\n\nRead More Today's top stories\n\nOfficers again recommended the plans for approval, subject to 32 conditions.\n\nAn exempt item on the agenda is understood to have contained information about what it was likely to cost the council if the developer were to appeal the committee's decision.\n\nCllr Hockey said she was \"really unhappy\" that she was being asked by officers to take into consideration \"this awful thing that's going to happen to your budget if you actually go against officer recommendations\".","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T21:08:00Z","eventUri":null,"image":"https://i2-prod.bristolpost.co.uk/incoming/article2571472.ece/ALTERNATES/s1200/0_BeFunky-collage-2.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.2313725490196078,"sim":0,"source":{"dataType":"news","title":"Bristol Post","uri":"bristolpost.co.uk"},"time":"21:08:00","title":"A new 24-hour Starbucks and McDonalds will not be coming to Bristol","uri":"1091391488","url":"https://www.bristolpost.co.uk/news/bristol-news/24-hour-starbucks-mcdonalds-not-2664891","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Spinks","type":"author","uri":"martin_spinks@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nNathan Jones has confessed he'd love a shot at managing Wales - but only after his work is complete at Stoke City.\n\nThe 45 year-old Welshman says no-one would be prouder if he ever got the call to arms to manage his country.\n\nBut he insists such ambitions are beyond the horizon as he continues to tackle the job that promises to define his entire career here at Stoke City.\n\nHe said: \"I want to manage at the highest level and I believe I'm on a pathway and taken calculated risks and gambles with my career... from assistant manager to a development coach to assistant manager to manager and now managing this great club.\n\n\"It would be something that would interest me, but don't take that out of context because I am very proud of my job here and I hope I'm here for a very long time.\n\n\"I hope I am successful with Stoke. I don't have a desire to do anything other than make Stoke an even greater club than I believe it is. And then you never know.\n\n\"Any Welshman, Englishman, Irishman or Egyptian, it's a proud moment when you're involved in anything to do with national honours.\"\n\nJones says he's proud of all 27 senior and Academy players currently away on international duty over the next fortnight.\n\n\"I am very proud of our internationals. It shows that you're recruiting top end players, but it also shows, especially with young ones, the work that you do here.\n\n\"We have perennial international players like Jack (Butland) and that's good for us and I enjoy that. People like Peter Etebo and the Welsh boys.\n\n\"It's good to see Jack still getting in because a lot was made of that, but he's still in the top one/two/three keepers in Britain, never mind England.\n\n\"We are delighted he's ours. So we embrace it, celebrate it, but pray they come back injury free.\"\n\nJoe Allen and on-loan Ashley Williams could feature for Wales in tomorrow night's friendly against Trinidad & Tobago in Wrexham, but Sam Vokes has been ruled out with injury after aggravating his recent groin strain during his Stoke return on Saturday.\n\nJones continued: \"I've been joking with the boys that I was never actually selected for the Welsh squad, which is quite phenomenal having played 600 games.\n\n\"I'm not bitter about it... as you can tell!\n\n\"It's a very proud moment any time you do get selected and we've got three that really enjoy it and have had success with the Welsh squad.\n\n\"I remember watching the Wales side with Ian Rush, Dean Saunders, Ryan Giggs, Kevin Ratcliffe, Neville Southall, all those, real superstars, but they never quite achieved what they deserved to as individuals.\n\n\"But Chris Coleman united a nation and got us playing a certain way.\n\n\"Gareth Bale is a superstar, but almost everyone else was playing in the Premier League, so they were of a real good standard.\n\n\"It was a real proud moment for us (at Euro 2016) because we were competing in the top four on the European stage, which was wonderful.\n\n\"Ryan (Giggs) has a real youthful squad now and I'm sure they will get there - and being a proud Welshman I hope they do.\"\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T20:16:00Z","eventUri":null,"image":"https://cf-images.eu-west-1.prod.boltdns.net/v1/jit/4221396001/f75e5db5-e6eb-4191-9f99-898dca99fbb1/main/1280x720/52s533ms/match/image.jpg","isDuplicate":false,"lang":"eng","sentiment":0.4588235294117646,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"20:16:00","title":"Nathan Jones on his dream job... after Stoke City","uri":"1091360451","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-nathan-jones-wales-2662678","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Spinks","type":"author","uri":"martin_spinks@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nStoke City striker Sam Vokes is out of Wales' friendly against Trinidad & Tobago tomorrow night.\n\nBoss Ryan Giggs says he aggravated a recent injury during his return to action for Stoke at the weekend.\n\nVokes, who was first injured shortly after scoring against Aston Villa on February 23, returned against Reading at the weekend but looked rusty and was eventually subbed on 70 minutes.\n\nSpeaking ahead of the Trinidad & Tobago game, Giggs stated: \"Tom Lawrence, Sam Vokes and Ethan Ampadu all haven't met up, they've got different injuries.\n\n\"Vokes has been struggling with a groin problem. He came back at the weekend, played 70 minutes and then just felt it again so the three of them are unavailable.\"\n\nThe news also leaves Vokes highly unlikely to be involved in Sunday's opening Euro 2020 qualifier against Slovakia in Cardiff.\n\nAnd that will delight Stoke manager Nathan Jones, notwithstanding his Welsh roots, as he hopes to get Vokes fit for his club side's return to Championship action at home to Sheffield Wednesday on Saturday week.\n\nVokes , who joined Stoke City in January as part of the deal that took Peter Crouch to Turf Moor, has featured six times for Jones and his goal against Villa is his only strike to date.\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T16:29:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2663685.ece/ALTERNATES/s1200/2_GettyImages-856588056.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.0117647058823529,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"16:29:00","title":"Stoke City striker out of international action","uri":"1091207444","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-vokes-wales-giggs-2663630","wgt":5},{"authors":[],"body":"BEDFORD, Mass.--(BUSINESS WIRE)-- Stoke Therapeutics, Inc. today announced the appointment of Stephen J. Tulipano, CPA, MBA as chief financial officer. Mr. Tulipano has more than 30 years of experience leading the financial operations of private and public companies in the biotechnology and healthcare industry. In this new role, Mr. Tulipano will add his deep finance experience to a management team with a proven track record in developing novel therapies for patients with rare genetic disorders.\n\n\"Steve's expertise in operating and funding biotechnology companies will be critical as the Stoke team advances our mission to develop precision medicines for genetic epilepsies and other diseases,\" said Edward M. Kaye, M.D., chief executive officer of Stoke Therapeutics. \"We are thrilled to have him on our senior leadership team as we continue to advance our pipeline towards the clinic.\"\n\nPrior to joining Stoke, Mr. Tulipano served as chief financial officer and treasurer of Aldeyra Therapeutics, Inc. (NASDAQ:ALDX), where he worked with the Aldeyra team to advance multiple product candidates in orphan and non-orphan diseases, led the company's strategic financings and completed a development and commercialization agreement with a major biopharmaceutical company, among other accomplishments. He also spent five years as chief financial officer of Javelin Pharmaceuticals, Inc., a pharmaceutical development company focused on pain relief that was acquired by Hospira, Inc. in 2010. Prior to that, Mr. Tulipano was director of corporate accounting at Biogen Inc. (NASDAQ:BIIB), where he led an accounting team supporting external reporting, research and development and manufacturing. He holds a B.S. in business administration and accounting from Salem State College and an MBA from the Sawyer School of Management at Suffolk University and is a certified public accountant.\n\n\"Stoke's approach of upregulating protein expression to treat the underlying cause of disorders like Dravet syndrome is novel and very exciting,\" Tulipano said. \"I look forward to joining this team of talented scientists and leaders dedicated to developing disease-modifying therapies for patients with severe genetic diseases.\"\n\nAbout Stoke Therapeutics\n\nLaunched in 2018, Stoke Therapeutics is pioneering a new way to treat the underlying causes of severe genetic diseases by precisely upregulating protein expression. Stoke is targeting a wide array of genetic conditions affecting the central nervous system, eye, liver and kidney. Its lead program is the potential first disease-modifying therapy for Dravet syndrome, a severe and progressive genetic epilepsy. To date, Stoke has raised $130 million in funding from two rounds of financing; investors include Apple Tree Partners, RTW Investments, RA Capital Management, Cormorant Asset Management, Perceptive Advisors, funds managed by Janus Henderson Investors, Redmile Group, Sphera Funds Management and Alexandria Venture Investments. For more information, visit www.StokeTherapeutics.com and follow Stoke on Twitter @StokeTx.","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T16:28:00Z","eventUri":null,"image":"http://www.firstwordpharma.com/sites/all/themes/custom/zen/fw4/images/fw_pharma_large_logo.jpg","isDuplicate":true,"lang":"eng","sentiment":0.1686274509803922,"sim":0,"source":{"dataType":"news","title":"firstwordpharma.com","uri":"firstwordpharma.com"},"time":"16:28:00","title":"Stoke Therapeutics Appoints Industry Veteran Stephen Tulipano as Chief Financial Officer","uri":"1091206769","url":"http://www.firstwordpharma.com/node/1630483","wgt":5},{"authors":[],"body":"FutbolArena Dış Haberler - Galatasaray'ın bu sezon başında kiralık olarak kadrosuna kattığı Badou Ndiaye'nin gelecek sezonda Stoke City'ye geri dönüp dönmeyeceği konusunda belirsizlik devam ederken, Ada basınında çıkan haberlere göre Stoke City taraftarları Ndiaye'nin geri dönmemek istememesine tepki gösterdi.\n\nGalatasaray Haberleri: Ndiaye Galatasaray'da kalacak mı?\n\nStokesentinel'in hazırladığı haberde Stoke City taraftarlarının görüşlerine yer verildi. Haberde ayrıca Galatasaray'ın, Stoke City'nin istediği 16-17 milyon euro civarındaki bonservis bedelini ödemeye yanaşmadığı ve Fatih Terim'in raporu doğrultusunda Ndiaye'nin kadroda tutulmak istenmesi halinde yeniden kiralık formülü üzerinde durulacağı kaydedildi. Stoke City yönetimi ise bu formüle sıcak bakmazken, taraftarlar Badou'nun geri dönmemek istememesine tepki gösterdi.\n\nİşte o paylaşımlar:Rob Salt: \"Geri dönmek istemiyorsa satın gitsin.\"\n\nChris: \"Ndiaye geri dönmeli. Eğer bu takımda oynamak istemiyorsa o zaman 23 yaş altı takımına gönderin.\"\n\nJamie: \"Ndiaye geri dönmeli. Devam eden sözleşmesi var. 1 aylığına onu 23 yaş altı takımına gönerin. Geldiği zaman takımın en iyi oyuncularından biriydi. Küçük bir gözdağı ile performansını yukarıları çekecektir.\"\n\nJames: \"Sözleşmesi bitene kadar Ndiaye'yi kiralık vermeye devam mı edeceğiz? Eğer Ndiaye oynamak istemiyorsa o zaman ondan iyi para kazanılmak zorunda. Aksi takdirde hata yapılır.\"\n\nSarı Kırmızılı takımla ilgili tüm gelişmelere Galatasaray Haberleri sayfasından ulaşabilirsiniz. FutbolArena haber turu (18 Mart 2019)","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T16:17:00Z","eventUri":null,"image":"https://www.futbolarena.com//imagesYUK/201903/b/stoke_city_taraftarlari_badou_ndiaye_icin_ayaklandiA1.jpg","isDuplicate":false,"lang":"tur","sentiment":null,"sim":0,"source":{"dataType":"news","title":"futbolarena.com","uri":"futbolarena.com"},"time":"16:17:00","title":"Stoke City taraftarları Badou Ndiaye için ayaklandı","uri":"1091197687","url":"https://www.futbolarena.com//galatasaray/stoke-city-taraftarlari-badou-ndiaye-icin-ayaklandi-367679h/","wgt":5},{"authors":[{"isAgency":false,"name":"Aidan McCartney","type":"author","uri":"aidan_mccartney@stokesentinel.co.uk"},{"isAgency":false,"name":"Kris Heneage","type":"author","uri":"kris_heneage@stokesentinel.co.uk"}],"body":"A re-cap of what opposition managers have been saying about Stoke in the Championship\n\nGet the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nStoke City arrived in the Championship with a target on their back after over a decade in the Premier League.\n\nTagged as one of the favourites to go up it hasn't entirely gone that way, and we looked at what all of Nathan Jones ' counterparts have said about Stoke this term.\n\nThat includes Marcelo Bielsa, Daniel Farke, Chris Wilder, Frank Lampard and the rest. We will be regularly updating this with all the best soundbites as the season goes on.\n\nThomas Frank -- Brentford\n\nFirst up for Jones was a trip to Griffin Park, and things didn't start well as the home side ran out comfortable winners. Thomas Frank did not hold back when assessing the club's season either.\n\n\"Yeah. I think you hear a lot of coaches say we can't just create magic, and I think they haven't performed all that well during the first part of the season,\" Frank said. \"I think Gary Rowett has done everything and his backroom staff everything to perform with the players.\n\n\"And I'm not saying that Stoke is a bad team. I'm just saying various reasons, there's so many factors that influence a bad performance. So I'm 100 percent sure Nathan will turn this around because what he has created in his coaching career is a statement I would say. So when they know him better, and they train with him better, I'm sure they will come back on track.\n\n\"What everybody needs to realise is it's not easy to go down and come back up. I think in the last five years only one team has done it, and that was Newcastle. So it's about building a foundation, and I think he can do that.\"\n\nMarcelo Bielsa -- Leeds United\n\nNext up was a home game against Leeds United and the somewhat eccentric Marcelo Bielsa. The Leeds boss admitted it was hard to do his usual diligent research of Jones as he was new to the Stoke job, but that didn't stop him digging through the Luton archives, and even claiming to be an idiot -- he would lose the game 2-1.\n\n\"As we're going to play Stoke, it's hard because they have a new head coach who has played just three games,\" he said. \"So what did we do? We analyse the 26 games he played with Luton, and we analysed the tactical structures we used. I would like to be held with the maximum humility. I give this explanation to make you understand why I think I am not cheating, by doing something that is not illegal. I know I am not trying to get an advantage. I already have the information. I repeat: Why do I do it? Because I think I'm stupid.\"\n\nAlex Neil -- Preston North End\n\nLooking to build on their first league win under Jones it was sadly not forthcoming with Preston. Neil's men travelled to the Bet365 Stadium and ran out comfortable 2-0 winners, a result Neil felt was thoroughly deserved.\n\n\"It was a continuation of what we did at QPR last week really,\" he said. \"We had changed the shape slightly, put Brad Potts out to the right and bumped Paul Gallagher inside to try and control the ball more. \"I thought we were great. In the first 30 minutes, we totally controlled the game, and the first goal was excellent.\n\n\"When you score the first goal there is always a little bit of thought when you think 'Should we try and turn it, not risk the ball anymore'? But we showed real bravery, moved the ball well and made Stoke change their shape before half-time which was a big compliment to us. We had worked for most of the week on dealing with the shape they changed to anyway, so the game continued in a similar way. At the end it was great to see Brad score the second.\"\n\nNigel Adkins -- Hull City\n\nUnfortunately, the poor form continued after the club's journey to Hull City, where a makeshift defence helped the Tigers earn a 2-0 victory. Adkins also took a less than subtle dig about the club's high spending ways and how his side -- which cost much less -- was able to compete.\n\n\"Another clean sheet at home, that's five wins at home on the spin and a good response from last week,\" Adkins said. \"I thought our defensive shape was excellent, Stoke spent a lot of money in the summer and they spent again in January.\n\n\"We've obviously gone into the game with five centre-halves missing. I thought Robbie McKenzie was exceptional, he's a young lad that has through the system since the age of ten and to go and play centre-half and keep the clean sheet and perform again the way he has was great to see. For me Eric Lichaj was man of the match in the centre-half position. He's usually a full-back, we've asked to play in the middle and I thought he was phenomenal. His defensive attributes were excellent and we've kept a great clean sheet.\"\n\nDarren Moore -- West Brom\n\nThe former Baggies favourite may no longer be in charge at West Brom, but he was still able to get the better of Nathan Jones when the pair met last month. They ran out 1-0 winners at the Bet365 stadium, and afterward, Moore was nothing but complimentary towards his opposite number.\n\n\"I can see the work Nathan is doing with them, they're getting better, so I'm really pleased to come away with the three points because that was a tough game,\" Moore said. \"This Stoke team is very different to where they were at three weeks ago. There won't be many coming here [to Stoke] now and winning. I certainly feel they're a different team even to when they won against Leeds -- they've gone up another level. They're only ever going to get better. They're a good team, the rotation they showed at times was excellent.\"\n\nPaul Cook -- Wigan\n\nThere was at least an improvement in the next game, however, as Jones picked up a draw against Wigan. Granted, at the start of the season it was a game most Stoke fans would expect to win, it did show signs of an improvement, with Latics boss Paul Cook admitting a draw was a fair result.\n\n\"There were stages in the game when both teams tried to gain control without their ever really being any clear cut chances,\" he said. \"Both formations allowed each other spells of possession, but without any cutting edge. We have to be pleased, especially when you look at the calibre of players that Stoke carry. It's pleasing to match up to these teams and have a good game. We were both trying to get high up the pitch to gain control of the opposition's half. \"They carry a great threat and late on we're happy with a point.\"\n\nPaul Lambert -- Ipswich Town\n\nThe man that unfortunately took Stoke down from the Premier League came back to haunt them less than a year later with his new club Ipswich Town. A late strike from Will Keane denied Stoke all three points, and saw Lambert praise his relegation-threatened side. It will no doubt concern Stoke fans that there was so little between a team aspiring for promotion and one fighting relegation.\n\n\"Do you know what, I thought we were excellent,\" said former Potters boss Lambert. \"We were up against a team I know really well, lads I know really well, and there was nothing in the game. Second half I thought we were relentless. I don't think Stoke really caused us too many problems for the squad that they've got and the size of club it is.\n\nDean Smith -- Aston Villa\n\nThe search for a win continued after a third successive draw, this time against Aston Villa, another fallen giant from the Premier League. It was a game of two halves for Villa, and their improvement is likely down to hearing the riot act from Smith at half-time.\n\n\"They gave the ball away cheaply, and I got into my players a bit at half time,\" Smith said. \"It wasn't the fact that they gave the ball away too easily it was their body language and the reaction to it (the goal). Second half was a really good display. We dominated the game and fully deserved the equaliser. I felt like we probably should have gone on to win the game. We certainly deserved something from the game.\"\n\n\"As scrappy as the first half was, we've still had the best chance of the first half when Anwar (El Ghazi) went through. He didn't show enough composure as he does in training. Their goalkeeper has made some really good saves from Tyrone's header and also Tammy's chance.\"\n\nMartin O'Neill -- Nottingham Forest\n\nHallelujah! A win! A 2-0 victory against Nottingham Forest was some much-needed relief for Stoke and Nathan Jones, and it came against a man in Martin O'Neill that turned down the chance to manage the club.\n\n\"No question that it was a disappointing afternoon for us,\" he said. \"We were terrific against Derby on Monday night but today we conceded a poor early goal from our point of view and unfortunately we were never able to retrieve it.\n\n\"You always expect the home side to be on the front foot from the start but the goal obviously gave them a big lift. I didn't think there was a lot between the two teams this afternoon but we didn't do enough to take anything from the game.\"\n\nSteve McClaren -- Queens Park Rangers\n\nThere were kind words from Steve McClaren after Stoke played most of the match with 10 men, but still emerged with a point at Loftus Road.\n\n\"I don't know what more we could have done,\" he said. \"I thought we did create chances against a very good Stoke side. It was like a training match for them, two banks of four and they were very difficult to break down. We put two young wingers on who were exciting and put crosses into the box, we had two strikers on and we put Luke Freeman in attacking midfield and went for it. We just lacked quality in the final third and it didn't quite drop for us.\n\n\"But I've seen games like that before where you lose it in the end. Not to get the three points was frustrating but making sure we didn't lose this one was important.\"\n\nFrank Lampard -- Derby County\n\nAnother 0-0 draw for the Potters, this time against the play-off chasing Rams, and it's safe to say Frank Lampard was not a happy man. However, he did get to see at first hand what a good goalkeeper Stoke have in Jack Butland.\n\n\"We were the only team trying to win the game, constantly and throughout,\" he said. \"We have to say to ourselves, can we be more clinical? And I think we can, but Jack Butland was very good.\n\n\"Butland is a top-class goalkeeper, we know that, the wood work and ourselves denied us the three points.\n\n\"They hit the post on the breakaway and we offered them a chance in the first-half for Ince on the counter-attack which was our own sloppiness, but the rest of the game was ours, completely ours.\"\n\nJose Gomes -- Reading\n\nAnother 0-0 draw for the Potters, this time against relegation-threatened Reading... and Royals boss Jose Gomes was blown away by the weather conditions at the bet365 Stadium.\n\nIt was a difficult game for both teams regarding the weather conditions,\" he said. \"Considering Stoke created some situations in the beginning and we created some in the end, it was a fair result.\n\n\"Regarding everything I said with the weather, I didn't like the game, it wasn't a beautiful game, but it was the possible game considering the weather.\n\n\"In that wind it was difficult to play. The ball moves on its own even if you don't touch the ball - so it's difficult and I don't know if you can realise it from the stands.\"\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T15:29:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2440287.ece/ALTERNATES/s1200/0_bielsa-jones.jpg","isDuplicate":false,"lang":"eng","sentiment":0.1529411764705881,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"15:29:00","title":"\"I'm not saying Stoke is a bad team\" - Here's what rivals think of Stoke City","uri":"1091160456","url":"https://www.stokesentinel.co.uk/sport/football/football-news/why-it-heres-what-leeds-2643163","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Spinks","type":"author","uri":"martin_spinks@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nFormer Stoke City striker Louis Moult has opened up for the first time about his binge drinking and trying to cope with the loss of his mum in his teens.\n\nNow 26, the Penkhull-born footballer, who came through the ranks at Stoke and left in 2012, says talking over problems can be the best way of coping with them.\n\nInstead, he turned to drink to drown his sorrows and he admits it could have cost him everything.\n\nSpeaking to The Mail, during a visit to a centre for vulnerable adults in Preston, Moult movingly re-lived his schooldays when his alcoholic mother lost her battle for life.\n\n\"I just locked myself in my room. My dad worked so I would pretend to get ready for school and then just get back in my bed and shut off from the world.\n\n\"My mum and dad were separated when I was six and me and my brother Jake were in and out of her life due to the alcohol.\n\n\"I remember going to her house one Christmas Day and Jake smelled it on her straight away. We walked straight out again. I was about 12.\n\n\"She may have known she was dying. I don't know. But the damage was already done.\n\n\"The sad thing is that when she died she was sorting herself out. From the age of 13 to 15 we had an unbelievable relationship.\"\n\nMoult, a Preston player since January last year, admits he suffered from having no-one to lean on for help and from male pride.\n\n\"I didn't have anyone to talk to. It was me, my brother and my dad, and men will be men. They are closed books.\n\n\"In the football dressing room no player wants to show a weakness. It's about being the funniest or the biggest or loudest.\n\n\"But I've learned that talking about stuff is the only way. There was a time when, at this point in the conversation, I would be crying. But I'm not.\n\n\"There was also a time when I was going out too much and my attitude was bad. I wasn't a very nice person. I think I have changed that.\n\n\"Carlie, my partner, told my dad she was getting worried. I thought I could control it, but then alcoholics say that. I wouldn't say I was one, but I was definitely binge drinking.\n\nThe pain that drove Louis Moult on at Stoke City\n\nIt was only five minutes, and it came in a 1-1 draw against Burnley at Turf Moor in March 2010, but his Premier League debut meant the world to a young Louis Moult.\n\nReflecting on his big moment with Martin Spinks at the time, he said: \"It was brilliant. It was a bit of a shock and I was buzzing with the atmosphere and the fact I was getting on.\n\n\"I was a little nervous, but I thought I'd be more nervous than I was. But when you get thrown on, there's no time to be nervous.\n\n\"People were saying to me after that I was now a Premier League player. I just said 'am I?', because I didn't think about it like that. It certainly won't go to my head.\"\n\nThe Penkhull-born youngster attributed much of his determination to succeed to the loss of his mum, Vicky, when he was just 15. He explained: \"She passed away three years ago. Me and my brother, Jake, have always been close, but losing mum brought me, my brother and my dad, Arthur, even closer together.\n\n\"They've been absolutely brilliant and I couldn't do it without them, so I want to say a big 'thank you' to my dad and brother.\n\n\"When I was 15, I went through a bad time with injury when I was out for a year with a groin problem. It was horrible for me, and then I lost my mum in the same year. But after that, once I got playing again, it took a lot off my mind. When you're not playing, you have too much time to think.\"\n\n\"When things are not going well in life you have a decision to make. As a nation going to the boozer has traditionally been our coping mechanism.\n\n\"But I think football can help with this. Players can set examples. Instead of going out, coming home and shouting at the missus, let's sit down and share our feelings.\n\n\"Footballers are just human beings and we have our stories. I have worked hard and have been through a great deal to get here. But I am just a normal person who got lucky.\n\n\"If I can help one other person by telling my story, then I will.\"\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T14:44:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article1910714.ece/ALTERNATES/s1200/0_moult-l.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.05882352941176472,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"14:44:00","title":"Ex Stoke City striker lifts lid on personal heartache and binge drinking","uri":"1091124375","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-louis-moult-preston-2662815","wgt":5},{"authors":[{"isAgency":false,"name":"Keith Wales","type":"author","uri":"keith_wales@stokesentinel.co.uk"}],"body":"It looks like £13.5m midfielder Badou Ndiaye will be returning to Stoke City from loan club Galatasaray in the summer\n\nGet the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nStoke City fans have been reacting to speculation that Badou Ndiaye could soon be joining the likes of Giannelli Imbula and Kevin Wimmer as big-money signings the Potters no longer want but are unable to move on.\n\nAccording to the Turkish media, the Senegal international is poised to return to the bet365 Stadium in the summer since cash-strapped loan club Galatasaray can't pay the €16m to €17m Stoke are said to want for him.\n\nBut Ndiaye's indifferent form for the Super Lig champions means they are also unlikely to enter into another loan for the 28-year-old and are looking elsewhere for midfield assets for next season.\n\nAlthough Ndiaye's future plans will not become apparent until the summer, Stoke fans already have plenty of experience of their club being saddled with big money recruits on long contracts that are impossible to move on, other than with loans.\n\nAnd they have some very clear ideas of what should happen with Ndiaye should he return and no lonfer want to play for the Potters.\n\nIt seems he remains reluctant to resume his Stoke career unless they are back in the top flight, an attitude hardly likely to endear him to new manager Nathan Jones.\n\nHere is what they are saying on social media...\n\nRob Salt: If they don't want to come back, sell them. Imbula says he's happy in Spain and Wimmer has an automatic transfer clause in his loan. Ndiaye is the only one that could be tricky.\n\nMatthew Hallett: Get them all back. You don't pay that type of money for players that aren't any good. Then let Nathan Jones make the decision whether they are worthy to play. You never know, under a new management regime they might come good. If not, loan them out again.\n\nRead More What's happening at Stoke City?\n\nChris Bloor: Bring him back and tell him he plays for Stoke or rots in the under-23s. He'll start to play if we don't back down.\n\nJanice Lowe: Don't ever come back to Stoke-on-Trent, Mr Hughes. You will not be welcomed.\n\nJohn Coffield: Ship them out, even at a loss, as ultimately Stoke City will lose out by keeping them until 2022. Take the hit and clear the infection at source.\n\nJamie McClellan: Make him stay and play. He's contracted. Put him with the under-23s for a month. That will sort him out. He was one of the better players in the relegation season, so make him and the rest believe.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away\n\nChris Roberts: I was hoping he would come back for pre-season with a better attitude and dig in because he is a good player. Hopefully Newcastle will come in and buy him.\n\nCarl William Bailey: Cut and run the best policy for these timewasters.\n\nMichael Stockton: The Mark Hughes legacy never ends.\n\nKeri Green: Get him back, make him squirm.\n\nHans Erik Kjosbakken: He's a good player if he wants to be. Maybe it'll work out.\n\nJohn Adams: Perhaps Nathan Jones can sort him out?\n\nJames Eaglesfield: So are we going to keep loaning them out until their contracts expire? Surely it is better to get some money for them now. As Stoke fans, we then deserve to be told how this happened and where the fault was.\n\nLeon Jenks: I'm assuming we get loan fees and at least a proportion of their wages paid when they go out on loan. It's still a shambles, but at least they are not a negative influence in the dressing room.\n\nPaul Cooper: And still nobody is accountable for this mess.\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T13:44:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2319860.ece/ALTERNATES/s1200/0_GettyImages-1056481042.jpg","isDuplicate":false,"lang":"eng","sentiment":0.2784313725490195,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"13:44:00","title":"Stoke fans have strong view on what should happen to Badou Ndiaye this summer","uri":"1091075414","url":"https://www.stokesentinel.co.uk/sport/football/transfer-news/stoke-city-galatasaray-badou-ndiaye-2662525","wgt":5},{"authors":[],"body":"Stoke Therapeutics, Inc. today announced the appointment of Stephen J. Tulipano, CPA, MBA as chief financial officer. Mr. Tulipano has more than 30 years of experience leading the financial operations of private and public companies in the biotechnology and healthcare industry. In this new role, Mr. Tulipano will add his deep finance experience to a management team with a proven track record in developing novel therapies for patients with rare genetic disorders.\n\n\"Steve's expertise in operating and funding biotechnology companies will be critical as the Stoke team advances our mission to develop precision medicines for genetic epilepsies and other diseases,\" said Edward M. Kaye, M.D., chief executive officer of Stoke Therapeutics. \"We are thrilled to have him on our senior leadership team as we continue to advance our pipeline towards the clinic.\"\n\nPrior to joining Stoke, Mr. Tulipano served as chief financial officer and treasurer of Aldeyra Therapeutics, Inc. (NASDAQ:ALDX), where he worked with the Aldeyra team to advance multiple product candidates in orphan and non-orphan diseases, led the company's strategic financings and completed a development and commercialization agreement with a major biopharmaceutical company, among other accomplishments. He also spent five years as chief financial officer of Javelin Pharmaceuticals, Inc., a pharmaceutical development company focused on pain relief that was acquired by Hospira, Inc. in 2010. Prior to that, Mr. Tulipano was director of corporate accounting at Biogen Inc. (NASDAQ:BIIB), where he led an accounting team supporting external reporting, research and development and manufacturing. He holds a B.S. in business administration and accounting from Salem State College and an MBA from the Sawyer School of Management at Suffolk University and is a certified public accountant.\n\n\"Stoke's approach of upregulating protein expression to treat the underlying cause of disorders like Dravet syndrome is novel and very exciting,\" Tulipano said. \"I look forward to joining this team of talented scientists and leaders dedicated to developing disease-modifying therapies for patients with severe genetic diseases.\"\n\nAbout Stoke Therapeutics\n\nLaunched in 2018, Stoke Therapeutics is pioneering a new way to treat the underlying causes of severe genetic diseases by precisely upregulating protein expression. Stoke is targeting a wide array of genetic conditions affecting the central nervous system, eye, liver and kidney. Its lead program is the potential first disease-modifying therapy for Dravet syndrome, a severe and progressive genetic epilepsy. To date, Stoke has raised $130 million in funding from two rounds of financing; investors include Apple Tree Partners, RTW Investments, RA Capital Management, Cormorant Asset Management, Perceptive Advisors, funds managed by Janus Henderson Investors, Redmile Group, Sphera Funds Management and Alexandria Venture Investments. For more information, visit www.StokeTherapeutics.com and follow Stoke on Twitter @StokeTx.\n\nView source version on businesswire.com: https://www.businesswire.com/news/home/20190319005437/en/","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T12:43:00Z","eventUri":null,"image":"https://www.marketscreener.com/images/twitter_MS_fdblanc.png","isDuplicate":false,"lang":"eng","sentiment":0.1686274509803922,"sim":0,"source":{"dataType":"news","title":"marketscreener.com","uri":"marketscreener.com"},"time":"12:43:00","title":"Stoke Therapeutics Appoints Industry Veteran Stephen Tulipano as Chief Financial Officer","uri":"1091024809","url":"https://www.marketscreener.com//news/Stoke-Therapeutics-Appoints-Industry-Veteran-Stephen-Tulipano-as-Chief-Financial-Officer--28192367/","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Smith","type":"author","uri":"martin_smith@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nOne of the things I dislike about the modern game are the international breaks which are foisted on us several times a season.\n\nThey usually arrive at the most inopportune times and leave supporters twiddling their thumbs for a couple of weeks.\n\nWith regards to this latest one, though, I'm glad it's arrived because I honestly need a little break from Stoke City right now.\n\nSeven games unbeaten should have us on the edge of our seats, feeling positive about the team and looking forward to the remainder of the season. Sadly, a closer examination of that run shows it is not all it's cracked up to be.\n\nThere are six drawers in there - four of them 0-0 affairs, including our last three matches - and it's part of an overall run of just three wins in our last 17 games.\n\nCoupled with a slim serving of entertainment during that run - the seven-game one or the 17-game one, take your pick - it's pretty lean fare.\n\nIt doesn't feel a lot different to the 10-game unbeaten run Gary Rowett's side put together not long before the club ran out of patience and sacked him.\n\nThere's a form table you can find on the internet which shows that since Christmas Day, 15 league games ago, Stoke are actually fourth bottom of the Championship table. Only Bolton, QPR and Ipswich are below us.\n\nRead More What's happening at Stoke City?\n\nThat's not the most telling statistic from this run, though. The one which chills the most reveals that during those 15 games we have scored just seven goals. That is less than one in every two matches.\n\nIf you want an amusing statistic with a Potteries angle, the only team in the Football League who have scored fewer goals than Port Vale, with just eight to their name, in 2019 are Stoke with seven.\n\nThat tally leaves us well adrift at the foot of the \"goals scored\" column in the form table. The next two nearest teams are relegation-bound Ipswich and Bolton, with 11 to their name, while nobody after that has less than 15. The runaway top scorers are leaders Norwich City, who have a staggering 36 goals in their last 15 games. That's only one less than the 37 we've scored in our 38 Championship games so far this season.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away\n\nOkay, so what's the point of all of this? Am I just trying to make Stoke supporters feel worse than they already do?\n\nWell no. In fact, I'm trying to put together an idea of what we're doing right now and what we might be building towards.\n\nOur current form is far from exhilarating, and despite an unbeaten run of seven games we are still stuck in 16th place with just 10 league wins to our name all season.\n\nWe are a long way from being an outfit capable of challenging for promotion, and we have an awful lot of ground to make up in time for next season.\n\nChampionship form table\n\nDuring this run of 15 games we have taken only 13 points. Even if you look at the unbeaten run of seven games, they have yielded only nine points. Extrapolate that over the course of a season and it only yields 59 points - a long way short of what we are realistically going to need to be genuinely competitive in 2019/20.\n\nLooking at things logically, it's hard to see where we're going to be adding to the midfield and forward areas of the team next season. Right now we have Allen, Etebo, Clucas, Woods and Adam to choose from in the middle. McClean, Ince and Verlinden are battling for the wide berths, while Vokes, Afobe and probably Campbell will be competing for what may be just one forward spot if Nathan Jones decides to go with his preferred 'diamond' formation.\n\nGiven how much money has been spent acquiring many of these players, you'd imagine the club will expect to get some value out of them. They'll certainly not be wanting to spend even more cash trying to replace them. And that assumes we could offload them in the first place.\n\nAt the moment, it seems as though our manager is working on shoring up his defence, and there's no question we are starting to see the positive results. Danny Batth has been instrumental in triggering a new-found solidity at the heart of our defence and seems to have helped bring back the very best in skipper Ryan Shawcross.\n\nIn those last 15 games I've mentioned from the form table we've conceded only 15 goals - and in the last seven unbeaten we've let in only two (with four scored ourselves).\n\nThis is to be welcomed and acknowledged of course. If Nathan Jones is taking a long-term view towards being effective next season then he obviously needs to get us mean and uncompromising at one end first.\n\nWhen you don't concede goals you put yourself in a position to win games with just one goal, and in that respect we may not be too far away from what aiming for.\n\nEventually, though, you have to start scoring goals - and you have to be able to score enough to compensate for those occasions when you do slip up at the back.\n\nAt the moment, based solely on what we're seeing on the pitch, we have a long way to go... and it's going to take a heck of an effort to get where we want to be.\n\nWe are, after all, a team which has now gone a mind-boggling 62 games since we last managed to score three goals in a competitive game.\n\nFortunately, the vast majority of fans are sticking with the team and Nathan Jones. They have pretty much written off this season, to the point where most are stoically accepting the lack of excitement and entertainment on the pitch.\n\nThe price for the manager, though, will be an increased expectation at the start of next season. And the price for the club may yet be seen in the uptake of season tickets - or the lack of it. Some supporters may not be encouraged enough by the prospect of what we are building by the time it comes for them to commit to next season.\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T11:46:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2643321.ece/ALTERNATES/s1200/0_PA-41747373.jpg","isDuplicate":false,"lang":"eng","sentiment":0.2705882352941176,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"11:46:00","title":"Martin Smith - Why this international break is a Godsend for Stoke City fans","uri":"1090979224","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-season-ticket-sales-2661459","wgt":5},{"authors":[{"isAgency":false,"name":"Amber Hicks","type":"author","uri":"amber_hicks@mirror.co.uk"},{"isAgency":false,"name":"Hayley Parker","type":"author","uri":"hayley_parker@mirror.co.uk"}],"body":"James Matthews, from Stoke-on-Trent, was recruited via a Kurdish Facebook page - and within days he was dodging bullets and gunning down jihadis\n\nA man has revealed how went from a homeless 'troubled teen' surviving off benefits to flying almost 3,000 miles away to fight against Islamic State in Syria and Iraq.\n\nFormer British soldier James Matthews grew up in Stoke-on-Trent and spent the early part of his life on the streets after being kicked out his home.\n\nHis \"saviour\" came in the form of the Army where he spent a four-year stint before leaving to go university.\n\nIt was while teaching English in Saudi Arabia that he came across a Kurdish freedom fighters Facebook group and made contact.\n\nWithin two days they had sent him instructions and a kit list, which included thermal underwear, reports Stoke-on-Trent Live .\n\nDespite a voice in his head \"telling me I was a fool\", James flew to Iraq to start training.\n\nJust days later he was in battle and dodging bullets being fired by jihadis.\n\n\"The light was fading and I thought: 'Is this where I die?'\" said James.\n\nNow the 43-year-old - known as Jim - has published a book detailing his reasons for heading to Syria - and the traumas he went through while there.\n\nIn an extract published by the Daily Mail , he says: \"Yes, I knew what I was doing - sort of. I'd served a tour of duty with the British Army. But never before had I faced real combat.\n\n\"Harsh, arid and freezing cold, the mountains in the far north of Iraq were a world away from Stoke-on-Trent, where I grew up.\n\n\"Yet for all the dust and the fear, this was where I truly wanted to be. My childhood had been chaotic - and I certainly became what you would call 'a troubled teenager'.\n\n\"It's not that I was stupid. I was pretty good academically but I wasn't interested in lessons and spent my time on the streets, getting up to no good.\n\n\"I was kicked out of school and out of home, too, and found myself living at a YMCA, surviving on benefits. Then came the Army - my saviour. It welcomed me and took me in for four years.\"\n\nJim left Stoke-on-Trent to join the Royal Pioneer Corps, then a Commando Logistics Regiment working alongside the Royal Marines and served as a Balkans peacekeeper in the 1990s.\n\nAfter leaving the Pioneer Corps, he went to university and became involved in radical politics before deciding to teach English as a foreign language in Saudi Arabia.\n\nBut, out of the blue in late 2014, his life took a different direction when he spotted a newspaper article about two Britons who had volunteered to fight against IS with the YPG, the Kurdish 'People's Protection Units'.\n\nJim said: \"The brutality touched something elemental in me. I remember a photo of a grinning IS fighter clutching a woman's severed head by the hair, one finger raised to the camera like some kind of gang sign.\n\n\"There was a wave of public feeling that this monster called IS just had to be fought.\n\n\"I had reached the age of 40 and here, at last, was a cause I could believe in. Maybe, even, live a life of 'nobility and honour'.\n\n\"So how does a boy from Stoke join a group of Kurdish freedom fighters? Via Facebook , of course.\n\n\"They were posting in the guise of a group calling themselves The Lions of Rojava and it took me only a few minutes to find them.\n\n\"I sent a private message and, after two anxious days, I got a reply. They asked in polite, if slightly broken, English if I had any military experience, whether I had taken drugs or been to prison 'because YPG will have no criminal'.\n\n\"I told them the truth - I'd been in the British Army - and it seemed to do no harm. Two days later they sent me instructions and kit list, including thermal underwear, plus the simple instruction: 'YPG pick you up From Airport Sulaymaniyah city of Iraq.'\n\n\"Of course there were doubts. My friends were astonished when I told them where I was travelling (although I hadn't told them why.) And with two weeks to go, there was still a voice in my head telling me I was a fool - that I should stick with a lucrative teaching contract in Saudi Arabia.\n\n\"My soul-searching and anguishing went on - but either I was going to board that plane or I wasn't. Perhaps it was the chance of a lifetime. It was certainly a chance to actually fight.\"\n\nAfter arriving in Iraq and making the journey to Syria in a white pick-up and crossing the Tigris river in a dinghy, Jim underwent three days of training before heading for Tal Hamis - and to battle.\n\nJim said: \"Halfway there I saw five armed figures sauntering away. They moved so nonchalantly that I couldn't be sure they were IS, so I fired a round over their heads. They broke into a run.\n\n\"Then, as I gained on them, two threw themselves down in the long grass - to give their comrades covering fire. The others kept moving. Bullets started zipping towards me as I sprinted forwards, zig-zagging left and right.\n\n\"An IS rocket flew over my right shoulder, falling somewhere behind me, and I dropped for cover.\n\n\"The two jihadis firing at me were using the ground well, popping up and down, running in short bursts and disappearing before shooting once again.\n\n\"I started firing back and, with my third shot, took one of them down. His screams reached my ears, stirring a feeling of guilt (I'd caused it) and dread (it could be me next).\n\n\"The second guy started to run back for his friend, but changed his mind and fled.\n\n\"My rifle jammed. I changed the magazine and was going through the drills to clear the barrel when a small, orange explosion blossomed up ahead, followed by a cloud of dirty smoke. The one I'd wounded had blown himself up with a grenade rather than be captured.\n\n\"'Well,' said a voice in my head. 'Now you've shot someone. Another human being. So, now how do you feel?' 'Ask me later,' I told it.\"\n\nJim was to remain in Syria for a year - losing several comrades along the way before deciding to head home.\n\nHe added: \"The decision was easy. I was making mistakes - taking a bit longer to get out of bed for my guard shift, failing to clean my weapon. I was utterly drained.\n\n\"So I went to my commander, Soran, a fireball of a man with a black beard and piratical headband, and I said I was done. I even gave him a hug before we parted. 'You good friend,' he said. It was true comradeship, and I miss it still.\"\n\nBut on his return to the UK in February 2016, Jim was in for a shock when he was detained and charged under the Terrorism Act at Passport Control.\n\nIt was another two-and-a-half years before the charges were finally dropped.\n\nHe said: \"I was outraged. Thanks to the wording of this Act, terrorism is defined as any kind of fighting or violence or 'any use of firearms or explosives... for the purpose of advancing a political, racial or ideological cause'.\n\n\"It is hopelessly broad and could trap almost anyone fighting a war, anywhere. I had been fighting with the YPG, which was not a proscribed terrorist organisation, against IS, which was. And I had been fighting alongside an international coalition that included Great Britain.\n\n\"I spent the next two-and-a-half years being summoned to shabby interview rooms in police stations to explain to the security services again and again that I was not a terrorist. Question after endless question were fired at me. 'What did you feel you achieved out there?' 'What were your strategic battle plans?' And all I could think about was pulling the dead and dying from the wreckage of burning towns.\n\n\"My passport was seized, and then the police announced the decision to charge me as a terrorist on Twitter - before they had the decency to let me know.\n\n\"Life was a struggle. The Halifax froze my bank account, refusing to explain why, and I nearly lost my home.\n\n\"When, finally, the charges were dropped, I still had no explanation from the authorities of why they'd done this, let alone an apology. Fighting the IS was one thing. Fighting the British State was another.\n\n\"How this war will be remembered by others, I don't know. But I'll always remember the warmth and kindness of my comrades in arms - and I'll always regret not making more of the time I shared with people who are now gone.\n\n\"I can't say for certain that I made a difference. But I know that, for once in my life, I belonged.\"\n\nAdapted from Fighting Monsters, by Jim Matthews, published by Mirror Books, priced £18.99.\n\nRead More Top news stories from Mirror Online","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T07:58:00Z","eventUri":null,"image":"https://i2-prod.mirror.co.uk/incoming/article14155826.ece/ALTERNATES/s1200/0_British-man-who-fought-against-ISIS-charged-with-terror-offence.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.0980392156862745,"sim":0,"source":{"dataType":"news","title":"Mirror","uri":"mirror.co.uk"},"time":"07:58:00","title":"How man went from 'troubled British teen' on benefits to fighting against ISIS","uri":"1090813744","url":"https://www.mirror.co.uk/news/uk-news/how-man-went-troubled-british-14155759","wgt":5},{"authors":[{"isAgency":false,"name":"Keith Wales","type":"author","uri":"keith_wales@stokesentinel.co.uk"}],"body":"Get the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nIt seems Badou Ndiaye will soon be joining the likes of Giannelli Imbula and Kevin Wimmer as big-money signings Stoke City no longer want but are unable to move on.\n\nAccording to the Turkish media, the Senegal international is poised to return to the bet365 Stadium in the summer since cash-strapped loan club Galatasaray can't pay the €16m to €17m Stoke are said to want for him.\n\nBut Ndiaye's indifferent form for the Super Lig champions means they are also unlikely to enter into another loan for the 28-year-old and are looking elsewhere for midfield assets for next season.\n\nNdiaye joined Stoke from Galatasaray for around £13.5m in January of last year on a contract that runs until the summer of 2022.\n\nHe was one of Stoke's better performers in the four months before they dropped out of the Premier League, but made it clear he was not prepared to play in the Championship. And after a poor game at Leeds on the opening day of the current season, he was quickly shipped back to Galatasaray on loan.\n\nTurkish sports newspaper Fanatik claims Galatasaray have already lined up a replacement for Ndiaye in the form of €5m Gent midfielder Anderson Esiti, although it seems Newcastle United's Mohamed Diamé is also an option.\n\nRead More What's happening at Stoke City?\n\nFanatik also claims Ndiaye remains reluctant to resume his Stoke career unless they are back in the top flight, an attitude hardly likely to endear him to new manager Nathan Jones .\n\nBoth Imbula and Wimmer, costing £18.3m and £18m respectively, are Stoke's two most expensive signings, yet both are on loan at other clubs.\n\nMidfielder Imbula, who arrived from Porto in January 2016, has since been loaned out to Toulouse in France and Spanish club Rayo Vallecano after failing to make the grade at Stoke. The 26-year-old is under contract until the summer of 2021.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away\n\nMore than one former Stoke team-mate has since accused him of having a poor attitude during his brief time at the club.\n\nCentre-half Wimmer is on a season-loan loan at German club Hannover 96 after flopping during his one and only season at Stoke. He is also 26 and under contract until the summer of 2022.\n\nAnd it now looks increasingly likely that Ndiaye will join them on loan again next season unless Stoke are prepared to take a considerable hit on their investment by moving the trio on for good in cut-price deals.\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T07:41:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2350352.ece/ALTERNATES/s1200/0_ndiaye-imbula-wimmer.jpg","isDuplicate":false,"lang":"eng","sentiment":0.1372549019607843,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"07:41:00","title":"Unwanted £13.5m recruit poised to join ranks of Stoke City's invisible men","uri":"1090803575","url":"https://www.stokesentinel.co.uk/sport/football/transfer-news/stoke-city-galatasaray-badou-ndiaye-2660542","wgt":5},{"authors":[{"isAgency":false,"name":"Laura James","type":"author","uri":"laura_james@stokesentinel.co.uk"}],"body":"The new contract is the latest for the Stoke-based firm on the city's four-year housing framework\n\nGet the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nConstruction and maintenance specialist Seddon is playing a major part in improving the city's housing stock.\n\nThe Stoke-based firm has been appointed by Unitas - Stoke-on-Trent City Council's housing maintenance company - to carry out major improvement works to domestic properties across the Potteries.\n\nThe latest work will see Seddon completely refurbish six derelict mid and end terrace properties on Morton Street and Maddock Street, in Middleport.\n\nRoofing, window and door replacement work is also set to be carried out on three blocks of flats at Downfield Place, Drakeford Grove and Newcastle Street, and flats on Bank Hall Road in Burslem.\n\nThe new contract is the latest for the firm on the city's four-year housing framework, which has seen Seddon complete work worth in excess of £1.7 million.\n\nIn that time it has replaced roofs and windows on 16 bungalows, carried out electrical works on multiple flats in Chell Street in Hanley, as well as roof and window replacement and ventilation works on 58 bungalows on the New Ford estate, in Smallthorne.\n\nRob Moore, business unit director for Seddon, said: \"Seddon has had a long association with the city, stretching back over 60 years, and we know the area very well.\n\n\"We are delighted to have been commissioned to do more work for the city through the framework.\n\n\"We are approaching the end of our first year on the framework and have completed a number of schemes. And this new housing improvement appointment reflects the enduring trust that exists in Seddon.\"\n\nCouncillor Randolph Conteh, cabinet member for housing, communities and safer city at Stoke-on-Trent City Council, said: \"The work is part of the city council's continuing drive to enhance living standards for its tenants, having committed significant multi-million-pound investment in its housing stock.\n\n\"Unitas's mission is to offer an improved, more flexible service for tenants and ensure that our property is maintained to a high standard.\n\n\"It's pleasing to see that Seddon - with a strong Stoke-on-Trent heritage - is still delivering for the area after seven decades.\"","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T05:22:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2659274.ece/ALTERNATES/s1200/0_morton.jpg","isDuplicate":false,"lang":"eng","sentiment":0.1215686274509804,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"05:22:00","title":"City homes are safe as houses after Seddon signs new contract","uri":"1090721192","url":"https://www.stokesentinel.co.uk/news/city-homes-safe-houses-after-2658689","wgt":5},{"authors":[{"isAgency":false,"name":"Keith Wales","type":"author","uri":"keith_wales@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid EmailTHE RUNNING MEN\n\nNathan Jones has warned full-backs like Tom Edwards they must be the club's \"most potent athletes\" next season.\n\nThe Stoke manager says the diamond system he wants to implement long term will place the greatest physical demands on his right and left full-backs.\n\nEdwards is currently the man in possession on the right after starting Stoke's last nine fixtures ahead of Moritz Bauer.\n\nBut Jones has made no secret of his desire to recruit a new left-back, possibly from old club Luton, as Bruno Martins Indi provides a stop gap for the rest of the season following the decision to send Erik Pieters out on loan in January.\n\nAnd Jones, a self-confessed stickler for detail and structure, says he has already mapped out every single day of pre-season training during July and August ahead of the 2019/20 campaign.\n\nFERGIE RECRUIT IN DEMAND\n\nWe listed five summer free agents who could be of interest to Stoke City boss Nathan Jones when the transfer window reopens in a few months' time.\n\nThey were Stewart Downing, the veteran Boro winger; George Boyd, the well-travelled Burnley midfielder; Chris Brunt, the veteran West Brom skipper and winger; Timm Klose, the international defender currently at Norwich City... and Nick Powell, the playmaker from Sandbach now plying his trade at struggling Wigan Athletic.\n\nWe also asked Stoke fans which of the five they thought could do a job for the Potters next season, and they have now had their say. And it is this former Manchester United player, signed by Sir Alex Ferguson himself, who they would like to see at their club next season.\n\nRead More What's happening at Stoke City? WHY IT PAYS TO BE PATIENT\n\nLou Macari column: Stoke City debutant Thibaud Verlinden doesn't have Jock Stein as his manager, but I trust he is still surrounded by good, sensible people.\n\nWhen I burst onto the scene at Celtic, there was no way you could get carried away when the great Jock Stein was your boss. But in this day and age it's very different.\n\nYoungsters will have an agent who's been telling them for years they are the best thing since sliced bread and, at the first available opportunity, will be knocking on the club's door and asking (even demanding) a pay rise before they have even achieved anything.\n\nSo my advice to Verlinden, and those advising him, is not to get carried away after the youngster's impressive first start for the Potters against Reading at the weekend.\n\nBOJAN THE SURPRISE TRAVELLER\n\nStoke City have no fewer than SEVENTEEN players out on international duty over the next fortnight.\n\nThere are 11 senior players representing their countries and a further half-dozen Academy graduates pulling on international shirts in various age categories.\n\nSaido Berahino has fallen out of favour at Stoke, but that won't stop him lining up for Burundi against Gabon on Saturday.\n\nOthers travelling a fair distance include Benik Afobe for DR Congo and Peter Etebo for Nigeria.\n\nElsewhere, there are three Stoke players in the Welsh party and, of course, Jack Butland away with England and James McClean with Ireland.\n\nBut most interesting of all, perhaps, is the inclusion of Bojan for Catalonia in a game against Venezuela next Monday.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away UP NEXT\n\nStoke City v Sheffield Wednesday, 3pm, Saturday, March 30, Championship, bet365 Stadium\n\nStoke played some of their most fluent football under Gary Rowett as they stormed into a two-goal lead in the reverse fixture at Hillsborough last September. But they then showed the frailties that would become all too familiar as the season progressed to allow the Owls to fight back and claim a 2-2 draw.\n\nBoth Stoke and Wednesday now have new managers in Nathan Jones and Steve Bruce, while the Owls are 10th in the Championship table and Stoke are down in 16th. Both teams are also on lengthy unbeaten runs - 11 games for the visitors and seven for the Potters. A 0-0 draw anybody?\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-19","dateTime":"2019-03-19T04:37:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2654312.ece/ALTERNATES/s1200/0_LBP_STO_160319StokeReading_027JPG.jpg","isDuplicate":false,"lang":"eng","sentiment":0.1372549019607843,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"04:37:00","title":"Warning for debut boy Verlinden as Stoke boss reveals he's a man with a plan","uri":"1090701619","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-bojan-verlinden-internationals-2660434","wgt":5},{"authors":[{"isAgency":false,"name":"Galatasaray Haberleri","type":"author","uri":"galatasaray_haberleri@gsgazete.com"}],"body":"Yeni sezonun transfer hazırlıklarına erken başlayan Galatasaray'da orta saha için devre arasında da kadroya katılmak istenen Anderson Esiti yeniden gündeme geldi.\n\nBursaspor karşısında aldığı galibiyetle Başakşehir'le arasındaki puan farkını yeniden 6'ya indiren ve şampiyonluk için yeniden ümitlenen Galatasaray gelecek sezonun transfer hazırlıklarına da şimdiden başladı.\n\nİlk hedef maliyeti az ve kaliteli oyuncular!\n\nYeni sezonda mali durumu çok fazla zorlamak istemeyen Sarı Kırmızılılar, ucuz, kaliteli ve uzun vadeli çalışmak istediği oyunculara yöneldi.\n\nNdiaye gidiyor...\n\nOrta sahanın Fernando ile birlikte dinamosu olan Badou Ndiaye sezon sonu takımdan ayrılacak ve kulübü Stoke City'ye dönecek. İngilizler onu satmak ve ciddi şekilde para kazanmak istiyor ancak Stoke City'nin istediği 16-17 milyon euroluk bonservis bedelini Galatasaray veremiyor. Bu yüzden Ndiaye'nin kalmasına imkansız gözüyle bakılıyor.\n\nStoke'ta da kalmak istemiyor\n\nStoke City'nin bu sezon Championship'ten Premier Lig'e yükselmesi imkansız ve Ndiaye bir alt ligde oynamak istemiyor. Bu yüzden orada da kalması mümkün değil ancak Stoke City'nin de ondan para kazanma isteği çok fazla...\n\nCim Bom'da Ndiaye'nin yerine ise, devre arasında da gündeme gelen Gent'in 24 yaşındaki orta sahası Anderson Esiti'nin transferi için çalışmalar olduğu öğrenildi.\n\nAnderson Esiti 5 milyon euro...\n\nBelçika ekibi Nijeryalı Esiti için 5 milyon euro talep ediyor. Galatasaray scout ekibinin de onay verdiği oyuncu için yönetimin bu parayı gözden çıkardığı öğrenildi.","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T21:13:00Z","eventUri":null,"image":"https://www.gsgazete.com/images/haberler/2019/03/badou_ndiaye_yerine_gelecek_isim_belli_oldu_yildiz_h32115_8f296.jpg","isDuplicate":false,"lang":"tur","sentiment":null,"sim":0,"source":{"dataType":"news","title":"Gsgazete.com","uri":"gsgazete.com"},"time":"21:13:00","title":"Badou Ndiaye yerine gelecek isim belli oldu! Yıldız..","uri":"1090505358","url":"https://www.gsgazete.com/futbol/badou-ndiaye-yerine-gelecek-isim-belli-oldu-yildiz-h32115.html","wgt":5},{"authors":[{"isAgency":false,"name":"Phil Corrigan","type":"author","uri":"phil_corrigan@stokesentinel.co.uk"}],"body":"Ofsted says children's social care at Stoke-on-Trent City Council is 'inadequate'\n\nGet the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nCity MPs have called on senior councillors to resign following a damning report on Stoke-on-Trent's 'inadequate' children's services.\n\nRuth Smeeth and Gareth Snell say three City Independent and Conservative cabinet members at Stoke-on-Trent City Council 'are not fit to hold public office' after Ofsted uncovered 'widespread and serious failures' in children's social care.\n\nThe Labour MPs are calling on council leader Ann James, deputy leader Abi Brown and lead member for children's services Janine Bridges to step down.\n\nBut the cabinet members have hit back at the MPs, accusing them of playing politics with the issue. And they insist that steps are already being taken to address the problems highlighted in the report, with an extra £3.7 million being diverted to children's services.\n\nOfsted found a catalogue of failings, with some children ending up in 'unsafe' placements and many others experiencing 'serious and widespread' delays.\n\nThe MPs say the City Independent-Conservative administration, which has been running the authority since 2015, has to take responsibility for these failures.\n\nMs Smeeth, MP for Stoke-on-Trent North, said: \"The contents of this report are utterly shocking, and a damning indictment on the leadership of Stoke-on-Trent City Council. I am absolutely appalled that the most vulnerable children in our city are being put at risk in this way.\n\n\"It is clear that the City Independent and Conservative administration has overseen a complete failure of children's social care over the last four years. The political leadership of the council are completely unfit for public office. For the sake of the safety of our children they must step down with immediate effect. The politicians responsible for keeping our kids safe have failed us, they've failed our city, and they've failed our families.\"\n\nMr Snell, MP for Stoke-on-Trent Central, added: \"This is an outrageous dereliction of duty on the part of the city council leadership. There is no greater responsibility for a local authority than keeping our young people safe, and it is clear that on Ann James's and Abi Brown's watch the council has failed to do that.\n\n\"Our children are being put at risk of real and serious harm because of the these peoples' actions. The failures highlighted in this report are shameful and cannot be allowed to continue.\"\n\nRead More Latest Stoke-on-Trent City Council News\n\nMs Bridges angrily rejected the resignation calls, and accused the MPs of being 'party political'.\n\nShe also insisted that action to improve children's social care was already underway, with a new case reporting system being brought in. But she accepted Ofsted's criticisms.\n\nMs Bridges said: \"I hold my hand up - we haven't done it quick enough, and we haven't dedicated enough resources. And we take on board everything Ofsted has said.\n\n\"We're all responsible - the police, the NHS, the city council, the senior management team - everybody is responsible, including the MPs, for not lobbying the Government. It's because they're party political, and so they just do what their party does. They don't give a damn what their constituents are doing, because they are protecting their own interests.\"\n\nMs Bridges said that while the council had been trying to address the problems with children's services, it had been 'overwhelmed' by the number of children coming into care.\n\nThe city council is currently looking after 854 vulnerable youngsters - up from 620 in 2015 - with a growing gap between the numbers being admitted into care and those being discharged.\n\nMs Bridges put this down to various factors including government austerity, increased migration and the dispersal of asylum seekers to Stoke-on-Trent.\n\nBut she also accused the council's own senior managers of failing to give children's services adequate resources.\n\nShe said: \"We have been overwhelmed - that's not my word, that's the word of the DfE chief inspector - by the numbers of children who have come into care. More children are coming into care because they have more complex issues, and the funding available just isn't enough.\n\n\"Authorities are having to divert more resources into children's social care. We knew this when there were projections from the austerity cuts, we knew that at the end of the day if more resources didn't come into local authorities you would be just looking at supporting children's social care and adult services, because you wouldn't have the money to do anything else.\n\n\"Having said that, we hold our hands up. Ofsted have highlighted the way that we report our cases, and what we've got to do is work from the bottom up - get those case reports right, get them done more quickly. They've got to be robust, and they've got to be accurate and child-focused. We can address those issues as a local authority - that is separate from the resource issue.\n\n\"I'm passionate about children's social care. I have fought very hard to divert resources into education, which is my portfolio, and now it shall be children's social care which I want to get to the same high standard.\n\n\"Unfortunately some of the powers-that-be don't see the value of diverting resources into children's social care, and quite often it's a big battle to get them to see the long-term gain. So really it's about changing the mindset of the senior management team. I'm talking about senior managers at the council, but I'm also talking about senior management and ministers in Government.\n\n\"I think it's taken this wake-up call to make the senior management team realise how serious this is. We have been telling them this for some time.\"\n\nUnlike with some authorities rated as inadequate, the city council will not see its children's services moved to a trust. Instead, the DfE is appointing a commissioner to oversee the council's action to address the issues raised by Ofsted, with major improvements expected within 12 months.\n\nConservative MP for Stoke-on-Trent South Jack Brereton, who is also a city councillor, said the Ofsted report was 'very disappointing'.\n\nHe said: \"I hope we can see some rapid improvements made and I am reassured some steps have already been taken, such as the establishment of an improvement board that meets weekly.\n\n\"It is essential for the safety and wellbeing of vulnerable young people in our city that these services are overhauled to provide long-lasting improvements. The additional funding we have secured locally through retained business rates will be particularly helpful in enabling the necessary reforms.\n\n\"The focus must be to improve standards, but we must also see a more effective service that is able to cope with the increasing number of children now in care.\"\n\nLabour group leader Mohammed Pervez echoed the city's Labour MPs in blaming the authority's City Independent-Conservative coalition.\n\nHe said: \"This is a very disturbing report to read. Put simply our children are being put at risk of serious harm. This is the result of four-years of the Conservative and City Independent coalition of chaos losing focus on their statutory duty and even getting the basics wrong.\n\n\"They can no longer hide and it's time for serious accountability. Year on year we challenged their cuts to services targeting vulnerable children and families but they were in denial. Now it's Ofsted telling them that you have failed.\"\n\nRead More Top stories on StokeonTrentLive\n\nWant to tell us about something going on where you live? Let us know - Tweet us @SOTLive or message us on our Facebook page. And if you have pictures to share, tag us on Instagram at StokeonTrentLive.","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T18:43:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/news/local-news/article370922.ece/ALTERNATES/s1200/neglected-lonely-abused-child.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.3098039215686275,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"18:43:00","title":"MPs call on council leaders to resign after damning report on children's care","uri":"1090419119","url":"https://www.stokesentinel.co.uk/news/stoke-on-trent-news/its-appalling-children-city-being-2659115","wgt":5},{"authors":[{"isAgency":false,"name":"Lou Macari","type":"author","uri":"lou_macari@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\n\"Stoke City teenager Thibaud Verlinden doesn't have Jock Stein as his manager, but I trust he is still surrounded by good, sensible people.\n\nWhen I burst onto the scene at Celtic, there was no way you could get carried away when the great Jock Stein was your boss.\n\nBut in this day and age it's very different.\n\nYoungsters will have an agent who's been telling them for years they are the best thing since sliced bread and, at the first available opportunity, will be knocking on the club's door and asking (even demanding) a pay rise before they have even achieved anything.\n\nIt's all wrong and is no good for the youngster either.\n\nI remember scoring a hat-trick at Parkhead when I was 19 and having 60,000 singing my name.\n\nThen after the game I was surrounded by the Press boys wanting their story.\n\nThat sort of thing can go to any teenager's head.\n\nLuckily for me, Jock Stein came out of the changing room and saw me holding court.\n\nIn no uncertain terms, and in language I can't possibly repeat here, he told the reporters to clear off.\n\nI could have sulked, or worse got stroppy, but I can assure you I agreed with the manager because that's how you were brought up in those days.\n\nSo my advice to Verlinden, and those advising him, is not to get carried away.\n\nThe young Belgian winger is obviously doing well otherwise he wouldn't have been handed his debut against Reading on Saturday.\n\nAnd by all accounts he did well on his debut, but that is no excuse for any young player to think he's arrived.\n\nAt this stage of his career he obviously lacks experience and as a result will probably lack consistency, so he has to not only work, but work even harder, to keep himself in the manager's eye so he keeps on getting chances and keeps on taking them.\n\nWhen you're managing youngsters like that you have to keep their feet on the ground because it may well be they are left out for the next game after being given their first taste.\n\nLook at Tyrese Campbell. He'd just scored a few goals after bursting into Stoke's first team, but a few days later he was being loaned out to Shrewsbury in the division below.\n\nNot as any kind of punishment, of course, but because he lacks that experience I spoke about and Stoke clearly believed he'd get more of that, at this stage of his career, out on loan.\n\nThe one big plus for a youngster, particularly one who's come through the ranks, is that the fans will be behind you for those early games and will cheer everything you do right and encourage you after anything you do wrong.\n\nI guess that could be particularly important for a winger who can't hide infield and as far as possible away from the stands.\n\nI see that Glen Johnson's radio interview caused quite a stir among supporters after he lifted the lid on some of the things he says was going on behind the scenes at Stoke last year.\n\nSome will say he shouldn't be raking over old coals, so to speak, while others will say fans deserve to know what has been going on as they continue to look for answers about why Stoke are where they are now.\n\nFrom his point of view, he had nothing to lose now he's retired, but he might have thought twice if he was looking for another club.\n\nHe was bemoaning the fact there were only eight good professionals in the Stoke dressing room, which would be a bit worrying if true.\n\nHe also pointed to the lack of leaders, but that's hardly anything unique.\n\nI know I'm sick of switching on the telly and hearing people moan about the lack of leadership in the game these days.\n\nFor whatever reason, they just aren't there in the modern game, maybe in today's society too.\n\nMy only question for Glen would be why he and the other good pros didn't take things into their own hands and sort out the bad eggs as he saw them?\n\nI knew that if I stepped out of line for any reason at Celtic or Manchester United, there would be players queuing up to grab me by the scruff of the neck to remind me football was a team game.\n\nJohnson painted a very dim picture of manager Mark Hughes and how he handled problems behind the scenes.\n\nI also heard a few stories about what was apparently going on and some of them made my toes curl, I must admit, but we must always remember there's two sides to any story and I'm sure Mark Hughes might have a different opinion on events. \"\n\n* Follow Lou on Twitter @LouMacari10\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T17:19:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2654312.ece/ALTERNATES/s1200/0_LBP_STO_160319StokeReading_027JPG.jpg","isDuplicate":false,"lang":"eng","sentiment":0.2,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"17:19:00","title":"Lou Macari: I trust Stoke City youngster won't be knocking on door for pay rise","uri":"1090361227","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-verlinden-celtic-macari-2657318","wgt":5},{"authors":[{"isAgency":false,"name":"Keith Wales","type":"author","uri":"keith_wales@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email Woodwork, wind, rain and handbags as Stoke City draw with Reading View gallery\n\nThere are plenty of things that Stoke City fans could be moaning about - no goals, few wins, tedious play and 16th place in a table they were tipped to top at the start of the season.\n\nYet compared to other times in the past two or three years, supporters appear almost stoic in the face of a 2018/19 campaign that is effectively over.\n\nSo have Stoke fans become a little apathetic, or is there something else at play here?\n\nStoke reporter Martin Spinks asked the question earlier today and fans have now responded. It seems most of them are putting up with a bit of pain today in the hope of joy tomorrow.\n\nThis is what they are saying on social media...\n\nPeter Wyatt: How have the Coates family become so successful with bet365 when their other business, our club, is run how it is? Shambolic really.\n\nCarl Steele: Because we can't keep changing manager and the majority of the players are garbage.\n\nMark Lister: We tried telling the board three years ago things were going wrong, but no-one wanted to listen. They couldn't see what the problem was then, so I doubt they'll see it now.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away\n\nAsh Mould: No point knocking if no-one is home, as the old saying goes.\n\nIan from Scholar Green: Given up.\n\nJames Hubbz: We sense the change.\n\nAdrian Matthews: Because anybody who knows anything about football can see we are making progress. The results will come.\n\nDavid Morris: Punch drunk after the last three years. We have to give Nathan Jones a chance.\n\nRead More What's happening at Stoke City?\n\nDave Stonier: The fans aren't moaning as much because we've all come to realise that the damage done to the club is absolutely enormous, and Nathan Jones needs at least another transfer window to get the players in he need to produce the attacking football we all want to see. On paper, he probably needs to have seven new players for next season as Edwards, Martins Indi, Batth, Etebo and Vokes are the only decent ones remaining. Butland and Allen will probably be sold for decent fees, and they'll probably be joined by Pieters, Ince, McClean, Diouf, Fletcher, Bojan and Berahino. Stoke should also be open to offers for Woods and Clucas\n\nDaniel Sadula: We've already used up too much energy moaning. People are numb to the boring football.\n\nAndrew Hollinshead: Because some of us still think we are a Premier League club, which we are not. Long summer ahead and fresh start next season. Nathan Jones' Barmy Army!\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T16:53:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2529675.ece/ALTERNATES/s1200/1_stoke-city-badges.jpg","isDuplicate":false,"lang":"eng","sentiment":0.1764705882352942,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"16:53:00","title":"THIS is why Stoke City fans have opted to suffer in silence","uri":"1090343415","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-fans-supporters-moaning-2659313","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Spinks","type":"author","uri":"martin_spinks@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nStoke City have no fewer than SEVENTEEN players out on international duty over the next fortnight.\n\nThere are 11 senior players representing their country and a further half-dozen Academy graduates pulling on international shirts in various age categories.\n\nSaido Berahino has fallen out of favour at Stoke, but that won't stop him lining up for Burundi against Gabon on Saturday.\n\nOthers travelling a fair distance include Benik Afobe for DR Congo and Peter Etebo for Nigeria.\n\nElsewhere, there are three Stoke players in the Welsh party and, of course, Jack Butland away with England and James McClean with Ireland.\n\nHarry Souttar, currently on loan at Fleetwood, will be linking up with Australia's under-23s for the first time after recently announcing his intention to throw his hat (with corks) into the ring with the Aussies rather than Scotland.\n\nMost interesting of all, perhaps, is Bojan's inclusion for Catalonia in a game against Venezeula next Monday.\n\nCatalonia is made up of Spanish nationals, as you might expect, and is not recognised by either FIFA or UEFA and so cannot participate in the World Cup or European Championships.\n\nHere, courtesy of Stoke City, is the full list of players away on international duty:\n\nBenik Afobe - DR Congo (v Liberia, 24/03/19)\n\nJoe Allen - Wales (v Trinidad & Tobago, 20/03/19; v Slovakia, 24/03/19)\n\nSaido Berahino - Burundi (v Gabon, 23/03/19)\n\nBojan - Catalonia (v Venezuela, 25/03/19)\n\nJack Butland - England (v Czech Republic, 22/03,19; v Montenegro, 26/03/19)\n\nTom Edwards - England U20 (v Poland, 21/03/19; v Portugal, 26/03/19)\n\nPeter Etebo - Nigeria (v Seychelles, 22/03/19; v Egypt, 26/03/19)\n\nJames McClean - Republic of Ireland (v Gibraltar, 23/03/19; v Georgia, 26/03/19)\n\nHarry Souttar - Australia U23 (v Cambodia, 22/03/19; v Chinese Taipei, 24/03/19); v Korea Republic, 26/03/19)\n\nSam Vokes - Wales (v Trinidad & Tobago, 20/03/19; v Slovakia, 24/03/19)\n\nAshley Williams - Wales (v Trinidad & Tobago, 20/03/19; v Slovakia, 24/03/19)\n\nAcademy players\n\nNathan Broome - England U17 (v Switzerland, 21/03/19; v Croatia, 24/03/19; v Denmark, 27/03/19)\n\nJosef Bursik - England U19 (v Czech Republic, 20/03/19; v Greece, 23/03/19; v Denmark, 26/03/19)\n\nNathan Collins - Republic of Ireland U19 (v Romania, 20/03/19; v Azerbaijan, 23/03/19; v Russia, 26/03/19)\n\nJake Dunwoody - Northern Ireland U21 (v Bulgaria, 22/03/19; v Mexico, 25/03/19)\n\nMax Murphy - Republic of Ireland U18 (v Turkey, 21/03/19; v Turkey, 23/03/19)\n\nScott Wara - Fiji (v Mauritius, 24/03/19)\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T16:15:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2658794.ece/ALTERNATES/s1200/2_GettyImages-1077070718.jpg","isDuplicate":false,"lang":"eng","sentiment":0.2313725490196079,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"16:15:00","title":"Unlikely duo among a fistful of Stoke City players on international duty","uri":"1090315051","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-berahino-butland-bojan-2658782","wgt":5},{"authors":[{"isAgency":false,"name":"Thomas Bamford","type":"author","uri":"thomas_bamford@bucksherald.co.uk"}],"body":"Telling the story of the Paralympic Movement, the Heritage Centre showcases objects, documents and memorabilia including tickets, medals, sports kit, photographs and programmes that were previously held in storage and not available to the general public.\n\nThe Heritage Centre also incorporates interactive displays, videos and a handling collection, highlighting sports unique to the Paralympics such as goalball and boccia.\n\nThe Paralympic Movement began in the late 1940s at Stoke Mandeville Hospital where Professor Sir Ludwig Guttmann encouraged wounded veterans to play sport as an aid to rehabilitation from spinal injury.\n\nThis led to local competitions, to the Stoke Mandeville Games and to the Paralympic Games which today attracts international support and a global broadcast audience of\n\nmore than 4 billion.\n\nThe National Paralympic Heritage Centre will celebrate and explore this unique history. The displays illustrate the determination, sportsmanship and vision that gave the world the Paralympic Games including:\n\n The life and work of Professor Sir Ludwig Guttmann.\n\n Key milestones in the journey from the 1948 Stoke Mandeville Games to the present day Paralympic Games.\n\n The development of wheelchair sports and technical innovations.\n\n Paralympic ceremonies.\n\nThis inspirational project would not be possible without the support of the British Paralympic Association, WheelPower - British Wheelchair Sport, Aylesbury Vale District Council and Buckinghamshire County Council.\n\nWith grant aid from the Heritage Lottery Fund, AIM Biffa Award 'History Makers' Programme, Rothschild Foundation, Aylesbury Vale Community Chest, Heart of Bucks and the Wellcome Trust.\n\nThe local community, who played an integral part in the establishment of the Paralympic Movement, continue to help by sharing their stories and volunteering as Ambassadors at the National Paralympic Heritage Centre.\n\nSir Philip Craven, Honorary President of the NPHT, said: \"My first recollection of Stoke Mandeville was from the 1967 National Games when as a 17-year-old I saw wheelchair basketball being played outdoors and thus dependent on the weather.\n\n\"Looking back, I recall a small area of not too attractive land sandwiched between the back of a large hospital and a railway embankment.\n\n\"To think that this is where the unique Paralympic sporting spirit was born fuelled by the human energy of the athletes, coaches and volunteers.\n\n\"To know now that this fiery furnace of positive human energy will be remembered forever makes me very happy\".\n\nNigel Purse, Chairman of the NPHT, said: \"Sports heritage has a wide appeal to the British public and with the support of our funders and founding partners we are able to celebrate the story of Professor Sir Ludwig Guttmann and the development of the Paralympic Movement where it all began at Stoke Mandeville.\n\n\"As well as protecting the unique heritage that could so easily be lost, the real satisfaction will be to share the inspiration behind the Paralympic heritage sport stories which are 'life changing'.\"","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T16:08:00Z","eventUri":null,"image":"https://images-o.jpimedia.uk/imagefetch/w_620,f_auto,ar_3:2,q_auto:low,c_fill/if_h_lte_200,c_mfit,h_201/https://www.bucksherald.co.uk/webimage/1.8853809.1552924768!/image/image.jpeg","isDuplicate":false,"lang":"eng","sentiment":0.2313725490196079,"sim":0,"source":{"dataType":"news","title":"Bucks Herald","uri":"bucksherald.co.uk"},"time":"16:08:00","title":"National Paralympic Heritage Centre set to open at Stoke Mandeville Stadium this weekend","uri":"1090309299","url":"https://www.bucksherald.co.uk/news/national-paralympic-heritage-centre-set-to-open-at-stoke-mandeville-stadium-this-weekend-1-8853810","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Spinks","type":"author","uri":"martin_spinks@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nStoke City may be languishing in 16th spot in the Championship, but they are top of the pops when it comes to drawing.\n\nThose three successive goalless draws has left them joint top in the entire country.\n\nOnly Conference club Halifax Town in the top seven divisions of English football can match Stoke's 17 draws to date - and lower down the footballing pyramid they have played too few games to challenge that record.\n\nStoke now have eight remaining fixtures to draw two more games to equal the club's highest number of draws in any one season, or three to beat it.\n\nThe current record stands at 19 draws during a 46-game season in Division Two in 1989/90.\n\nIt was the 'Alan Ball' season when Stoke finished bottom of the division after supplementing all those draws with only six wins, but 21 defeats.\n\nMOST DRAWS THIS SEASON\n\n17: STOKE CITY, Halifax\n\n16: Sunderland, Northampton, Chesterfield\n\n15: Aston Villa, Nottingham Forest, Rotherham, Ipswich, Guiseley\n\nMOST DRAWS IN STOKE'S HISTORY\n\n19: 1989/90\n\n18: 1923/24, 1980/81\n\n17: 1953/54, 2018/19\n\n16: 1921/22, 1973/74, 1978/79\n\nManager Nathan Jones, sharing the frustration of supporters, said this after Saturday's stalemate against Reading.\n\n\"Scoring changes the complexion of games and at the minute we're not changing the complexion of the game because we're not taking chances when we're in the ascendancy.\n\n\"That happened at Wigan, it happened at Ipswich, that's why we've only drawn games.\n\n\"We probably had less chances against Forest than we did in the first half today but we won the game 2-0 quite comfortably because we scored at good times and took our opportunities.\"\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T15:15:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2640576.ece/ALTERNATES/s1200/4_macca-happy.jpg","isDuplicate":false,"lang":"eng","sentiment":0.192156862745098,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"15:15:00","title":"We've found a table Stoke City are topping","uri":"1090267351","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-draws-jones-butland-2658009","wgt":5},{"authors":[{"isAgency":false,"name":"Keith Wales","type":"author","uri":"keith_wales@stokesentinel.co.uk"}],"body":"Get the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email Woodwork, wind, rain and handbags as Stoke City draw with Reading View gallery\n\nWe listed five summer free agents who could be of interest to Stoke City boss Nathan Jones when the transfer window reopens in a few months.\n\nThey were Stewart Downing, the veteran Boro winger; George Boyd, the well-travelled Burnley midfielder; Chris Brunt, the veteran West Brom skipper and winger; Timm Klose, the international defender currently at Norwich City; and Nick Powell, the playmaker from Sandbach now plying his trade at struggling Wigan Athletic.\n\nWe also asked Stoke fans which of the five they thought could do a job for the Potters next season, and they have now had their say.\n\nWhile there was periferal interest in the likes of Brunt and Klose, it was 24-year-old Powell who got the fans' vote.\n\nFresh in their memory will no doubt be the 3-0 thrashing handed out to Stoke by Wigan at the bet365 Stadium back in August when Powell was at his mercurial best.\n\nWill Grigg and Gavin Massey bagged the goals for the Latics that night, but it was Powell who pulled the strings - and his running battle with Stoke centre-half Ashley Williams only ended when the Welshman was given his marching orders 12 minutes from time.\n\nSo why Powell? We've taken a look at what he could bring to the Potters and also some of the pitfalls of a deal for the former Manchester United man.\n\nRead More What's happening at Stoke City? What is the attraction?\n\nNathan Jones is expected to try to clear the decks this summer. He inherited a rag-tag squad of players recruited in the main by Stoke's previous three managers when he took the job in January.\n\nThe Welshman has a certain way he likes his teams to play, and he learned early on in his tenure at the bet365 Stadium that many of the players at his disposal are ill-equipped to play the Nathan Jones way.\n\nSo would Powell fit the bill? Yes, and on at least two counts.\n\nAt Wigan, he has predominantly played as a floating number 10 and formed a great partnership with Stoke tormentor Grigg.\n\nJones is a keen advocate of the \"diamond\" midfield formation, and Powell could be deployed as the tip of a midfield four.\n\nBut he is also capable of being the main striker too, either playing off a fellow forward or on his own should Jones want to alter the thrust of his attacking threat during games.\n\nThe Potters are crying out for some creativity to conjure up the goals so sadly lacking at the moment, and Powell is certainly capable of providing it.\n\nWhat are the pitfalls?\n\nWhile Powell looks like he would be a great fit for Stoke, a deal to bring him to the bet365 Stadium could finally see Bojan ushered out of the club.\n\nTo be fair, lack of game time means the little Catalan will probably on his way this summer anyway. But there seems little chance of Jones accommodating both him and Powell when he is determined to trim his already bloated squad.\n\nThat said, any club signing Powell is likely to need decent cover, and that's because he has a reputation for sustaining lingering injuries.\n\nReaction: Stoke 0, Reading 0 Match report: Add another draw to list In pictures: Gallery of the action The debut boy: I have a lot to learn Player ratings: Youngsters the stars Nathan Jones: We need momentum Opposition view: Reading boss blown away\n\nFor example, he was playing some of his best football for years when hamstring and calf injuries saw him sidelined for 12 games over Christmas and into the New Year. It's a familiar tale of woe for the former England under-21, and his absence coincided with Wigan's decline after a bright start to the season.\n\nHe made his comeback in the 0-0 draw with Stoke at the DW Stadium on February 13, but has yet to find his best form again. He said: \"It been frustrating for me, but now all I want to do is finish the season as strongly as I can.\"\n\nFinally, should Powell decide to move on this summer, and if Stoke are ready to revive their previous interest in him, they could face plenty of competition for his signature.\n\nBrighton were rumoured to be suitors in the last transfer window, and a decent finish to the season could attract wider interest.\n\nWhat they said\n\nFormer Wigan boss Gary Caldwell: \"He's a game-changer - he will win games for you at any level. He's somebody you have to constantly challenge, the game comes too easy to him sometimes. If you're just doing a simple drill, he can almost get bored because he is so talented. He still has the potential to play for a United or another top club.\"\n\nSteve Phillips, former Crewe Alex team-mate: \"He was about 16 when I first joined Crewe; he trained with the first team at a very young age and straight away had that arrogance which you need to be a top player. Sometimes that went a little bit too far, but his ability and the speed of his thinking was way ahead of anything I've ever seen. He was on another level. In my head, I always thought he would play for England.\"\n\nSir Alex Ferguson, former Manchester United manager: \"He is an exceptional talent and has been schooled well at Crewe.\"\n\nScott Wootton, former Manchester United team-mate: \"Physically, he is a lot stronger than people think, he is a lot quicker than people think - he has a great change of speed. He can dominate games when he wants to, and at the flick of a switch.\"\n\nWill Grigg, Wigan team-mate: \"He wants the ball and you get him on it to create things. He can run in behind and he's got a bit of everything.\"\n\nWhat fans said on social media\n\nJames Hubbz: We need more youth in this league. Speed and agility as well as skill. Bring Tyrese Campbell back.\n\nAnthony Shaw: None of them - I'd be looking for hungry youngsters from the lower leagues who have something to prove, not journeymen.\n\nCol Galloway: Nick Powell.\n\nAndrew Rushton: Powell.\n\nTrevor Woolridge: Powell.\n\nChris Roberts: I'd take Klose and Powell.\n\nRon Simpson: Not giveaways again. Doesn't anybody realise why nobody wants these players already? We've got a shed full of cast-offs.\n\nBen Cliff: Powell for me.\n\nBarry Sherratt: Only Powell is a maybe for me.\n\nAaron Finney: Klose and Powell for me\n\nDanny Sayer: I'd take Klose and Brunt - a solid centre-back and a bit of a dead ball specialist.\n\nGrant Piland: I would take Powell but also need a younger version of Charlie Adam.\n\nNick Whitehead: Would defo take Nick Powell.\n\nStephen Goold: Only Klose interests me, but we don't need another centre-back. Powell too injury prone.\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T15:02:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2658221.ece/ALTERNATES/s1200/0_powell-v-stoke.jpg","isDuplicate":false,"lang":"eng","sentiment":0.1215686274509804,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"15:02:00","title":"Revealed: The former Man United star Stoke fans would like to see at their club","uri":"1090257009","url":"https://www.stokesentinel.co.uk/sport/football/transfer-news/stoke-transfer-news-nick-powell-2658253","wgt":5},{"authors":[{"isAgency":false,"name":"Martin Spinks","type":"author","uri":"martin_spinks@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nWill Stoke City fans carry on tolerating a team that can't score, can't win too often and is lying 16th in the table when once-upon-a-time most expected them to be in or around the top six?\n\nThe answer appears to be a YES and that might surprise outsiders wondering why there isn't rioting in the streets.\n\nSo have Stoke fans simply stopped caring and become a little apathetic, or is there something else at play here?\n\nThey certainly haven't stopped caring but, while there are obviously a few grumbles out there, most supporters seem to be taking the longer-term view and putting up with pain today in the hope of joy tomorrow.\n\nAfter the last couple of years, perhaps there is now less expectation of their team, a cold realisation that there is now no option but to almost start from Ground Zero.\n\nCombined with that is the hope that they have a manager best suited to begin a re-building job on a club likely to finish in the bottom half of the Championship.\n\nNathan Jones is certainly saying what we now want to hear, isn't he?\n\nAfter all the shenanigans of the last few years, which were resurrected again at the weekend by Glen Johnson's revelations, we want reassurances that Stoke will be trawling the market for good pros as well as good players.\n\nAnd if the manager has his way, good athletes with a capacity to finish a 90 minutes as brightly as they started.\n\nIt's fair to assume he's been surprised, shocked even, by some of the fitness levels Stoke have clearly been leaning upon during their decline from top-10 Premier League to bottom-10 Championship.\n\nIt's also fair to assume his code of discipline will be higher than at least one of his recent managerial predecessors and will be more rigorously enforced.\n\nHis managerial reputation depends upon it and he has no intention of seeing events consume him like they did Paul Lambert and Gary Rowett.\n\nHe will need the support of fans, or at least the majority of them, however, and isn't naive enough to think their current goodwill can last indefinately.\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T11:45:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2501364.ece/ALTERNATES/s1200/2_stoke-fans-at-hull.jpg","isDuplicate":false,"lang":"eng","sentiment":0.4901960784313726,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"11:45:00","title":"Stoke City Comment: Why aren't fans moaning more?","uri":"1090100540","url":"https://www.stokesentinel.co.uk/sport/football/football-news/stoke-city-supporters-nathan-jones-2656632","wgt":5},{"authors":[{"isAgency":false,"name":"Aidan McCartney","type":"author","uri":"aidan_mccartney@stokesentinel.co.uk"},{"isAgency":false,"name":"Josh Challies","type":"author","uri":"josh_challies@stokesentinel.co.uk"}],"body":"Get the biggest Weekday Stoke City FC stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nAnother huge weekend has changed the picture at the top and bottom of the Championship following several crucial results going into the final international break of the season.\n\nThe biggest clash was the early kick-off between promotion-chasing duo Leeds United and Sheffield United, which the latter won 1-0, and Norwich City then extended their lead at the top with a win over Rotherham.\n\nPreston North End continued their tremendous run of form with a victory over Birmingham City, inflicting a heavy hit onto the Blues' promotion hopes, while there was also victories for Aston Villa and West Brom.\n\nAt the bottom, Wigan Athletic secured a valuable win against fellow strugglers Bolton Wanderers to hand their survival hopes a significant boost and they left their opponents in a tricky position.\n\nWith lots to play for, it's a tough task to predict exactly what will happen but FootballWebPages have done exactly that by producing a table using a combination of teams' form, results, current standings and their run-in.\n\nNorwich City will take the title with a massive 98 points, with Sheffield United securing the second automatic promotion spot ahead of Leeds United - the difference being just two points.\n\nMarcelo Bielsa's side therefore enter the playoffs, where they are joined by West Brom, Aston Villa and Middlesbrough - the latter of whom are tipped to finish three points ahead of Nottingham Forest.\n\nRead More What's happening at Stoke City?\n\nAt the other end of the table, Bolton and Ipswich would finish well adrift of safety and Rotherham United will join them in League One, finishing behind Reading on goal difference.\n\nStoke City, meanwhile, are destined to finish in 17th place, way off of the top spot they were tipped to claim at the start of the season. Their predicted points total of 54 would leave them 18 off ther play-offs and 14 above the final relegation place.\n\nThe predicted Championship table\n\nNorwich City - 98 points Sheffield United - 90 points Leeds United - 88 points West Brom - 83 points Aston Villa - 72 points Middlesbrough - 72 points Nottingham Forest - 69 points Bristol City - 68 points Preston North End - 66 points Derby County - 66 points Brentford- 65 points Swansea City - 65 points Hull City - 62 points Birmingham City - 61 points Sheffield Wednesday - 61 points Blackburn Rovers - 59 points Stoke City - 54 points QPR - 54 points Wigan Athletic - 49 points Millwall - 48 points Reading - 41 points Rotherham - 40 points Bolton - 32 points Ipswich Town - 30 points\n\nFor all your latest Stoke City news, opinion, analysis and transfer gossip, click here","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T10:30:00Z","eventUri":"eng-4668534","image":"https://i2-prod.stokesentinel.co.uk/incoming/article2654485.ece/ALTERNATES/s1200/0_GettyImages-1131047185.jpg","isDuplicate":false,"lang":"eng","sentiment":0.5607843137254902,"sim":0.7607843279838562,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"10:30:00","title":"Supercomputer predicts Championship table: bad news for Leeds but good for Villa","uri":"1090043863","url":"https://www.stokesentinel.co.uk/sport/football/football-news/supercomputer-predicts-final-championship-table-2654486","wgt":5},{"authors":[{"isAgency":false,"name":"Phil Corrigan","type":"author","uri":"phil_corrigan@stokesentinel.co.uk"}],"body":"Ofsted has given children's social care at Stoke-on-Trent City Council the lowest possible rating\n\nGet the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nVulnerable youngsters are being failed by 'inadequate' children's services in Stoke-on-Trent, inspectors have found.\n\nOfsted has given children's social care at Stoke-on-Trent City Council the lowest possible rating following an inspection in February.\n\nAccording to the report, children 'are not being protected', and experience 'serious and widespread delays' in having their needs met.\n\nServices for children have 'seriously declined' since the last full inspection in 2015, as a result of 'poor leadership, management oversight and an absence of clearly evaluated performance inspection'.\n\nOfsted says that the council knows that some children are in 'unsafe', unregulated placements, due to the authority having insufficient numbers of foster carers.\n\nWhile many social workers are committed and dedicated, they are not being supported to practise safely.\n\nCouncil chiefs say they are taking the damning report 'very seriously' and have vowed to make major improvements.\n\nThe report states: \"Children are not being protected, and they experience serious and widespread delays in having their needs met across children's services.\n\n\"Leaders have not sufficiently understood the extent and impact of the failures and have been ineffective in prioritising, challenging and making improvements.\n\n\"As a result of poor leadership, management oversight and an absence of clearly evaluated performance information, services for children have seriously declined since the last full Ofsted inspection in 2015, and the majority of recommendations made at that inspection and at a focused visit in 2018 have not been actioned.\n\n\"Vulnerable children are not safeguarded in Stoke-on-Trent. A coherent framework to support the delivery of social work to children and families has not been implemented.\n\n\"Inspectors did meet a considerable number of dedicated and committed social workers. However, they are not being supported to practise safely.\n\n\"No social worker is receiving one-to-one case supervision, and this means that there is little management direction and challenge to their work.\"\n\nThe number of children in care in Stoke-on-Trent rose to a record 836 in December, with a growing gap between admissions and discharges.\n\nIn its previous full inspection, in 2015, the city council received a 'requires improvement' grade - the second lowest of the four possible ratings.\n\nFollowing a 'focused visit' last year, inspectors said caseloads were 'too high', with many social workers having to work with 30 vulnerable children. Ofsted also noted that there had been 'insufficient' recording of managers' decisions.\n\nThe city council received 'inadequate' grades across the board - in 'the impact of leaders on social work practice with children and families', 'the experiences and progress of children who need help and protection', the 'experiences and progress of of children in care and care leavers', and 'overall effectiveness.\n\nOfsted has made 15 recommendations for improving services, such as improving staffing capacity and better management oversight.\n\nCouncil leaders say are taking 'immediate action' to make improvements to children's services and address the problems raised by Ofsted,\n\nSteps include an immediate multi-million pound investment into services, the appointment of a new management team and direct operational changes to improve responses to contacts from families and agencies.\n\nCouncil leader Ann James said: \"We take the ruling by Ofsted extremely seriously and are very concerned by the findings. In carrying out their inspection, Ofsted officials spent time with frontline social workers. They found that our workers are dedicated and work extremely hard to support children and families, but that there are a number of challenges with social work practice and that more support and challenge is needed from managers. It means that our practices are not robust enough to provide the best protection to meet the needs of our city's vulnerable young people. This is unacceptable and we are committed to improving our service at pace for our children.\n\nRead More Latest Local Politics News\n\n\"The number of children entering our care in the city has increased significantly year-on-year. This is a contribution to our challenge but we accept that it is not the only reason why we find ourselves in this position.\n\n\"I'd like to reassure families that we have listened closely to all the comments from inspectors, have identified areas where improvements need to be made, and welcome the support of Ofsted and other partners in helping us to address these issues as quickly as possible. We are absolutely committed to supporting children in our city and improving our services - we will quickly move to a much improved position.\"\n\nThe city council currently has an interim director of children's services, following the departure of Louise Rees earlier this year.\n\nOfsted noted in its report that Mark Barrat actually started work as interim director on the first day of the inspection.\n\nCouncillor Janine Bridges, cabinet member for education and economy, said: \"I'd like to reassure families that we are determined to drive the changes that are needed. We have to get the foundations right so that we can deliver a service that is fit for the needs of young people today.\n\n\"Ofsted have given us a clear direction on where we need to improve, with a commitment that all agencies come together to implement improvements to services.\n\nRead More Latest Stoke-on-Trent City Council News\n\n\"We know what we need to do and have already started this work. A new children's improvement board has been established, involving partners, which will include the police service, representatives from our schools and the Local Government Association. We are already working closely with Ofsted and the Department for Education to drive improvements for our children.\n\n\"We are also working with other authorities who have taken the journey from inadequate to outstanding, to learn from their practices.\n\n\"The needs of our city's children will always remain at the centre of all we do. We have a new management team with the drive and commitment to bring about the changes needed. Our frontline staff work exceptionally hard in very difficult circumstances, and I would like to praise them for their hard work.\n\n\"In other areas of children's services, we are delivering real, life-changing support to our city's young people. More children now go to good and outstanding schools than ever before, we have successfully lobbied government for a new special educational needs school for the city, and our early years speech and language therapy work is a national leader, helping to ensure that children have the right skills and development to enter education and succeed. We will be bringing the same focus and drive to deliver the improvements needed in all of our social care services to ensure that they are fit for the 21st century.\"\n\nChildren's services at Staffordshire County Council were rated as 'good' by Ofsted, following its latest inspection this year.","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T10:05:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article1114647.ece/ALTERNATES/s1200/1_sadchild.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.1294117647058823,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"10:05:00","title":"'Inadequate' children's services failing vulnerable youngsters, inspectors find","uri":"1090025130","url":"https://www.stokesentinel.co.uk/news/stoke-on-trent-news/inadequate-childrens-services-failing-vulnerable-2656619","wgt":5},{"authors":[{"isAgency":false,"name":"Dave Knapper","type":"author","uri":"dave_knapper@stokesentinel.co.uk"}],"body":"Get the biggest Daily stories by emailSubscribeSee our privacy noticeThank you for subscribingSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nA documentary shining the spotlight on Stoke-on-Trent's monkey dust epidemic could be picked up by a major broadcaster after getting nearly a million hits on YouTube.\n\nThe 15-minute 'Stoke-on-Dust' film sees users give first-hand accounts of their addictions and volunteers reveal what they're trying to do to combat the issues caused by the class B drug.\n\nStudents shot the documentary between October and December and it has now been viewed 928,000 times.\n\nThey linked up with gym owner Baz Bailey, from Chesterton, who kick-started the Time For Action group to raise awareness and 'bust the dust dealers'.\n\nThe 48-year-old has experience of what monkey dust can do after his son Rio was once caught in its grip. The former athlete previously told StokeonTrentLive how he had been on week-long benders.\n\nDad Baz told the documentary makers: \"It's got to the point where drastic action is needed. If I can stop someone's son, daughter, brother, sister or parent from taking it then I have to keep moving forward. It needs reclassifying as a class A drug.\"\n\nOne female user interviewed outside the Salvation Army hostel, in Stoke, said: \"I've been addicted to heroin since I was 14 - and I'm addicted to it (monkey dust) now. It's the worst thing going. Not the physical side effects, but the psychological.\n\n\"It's ludicrous what people will do for the drug - they will sell their grandma down the river for a pipe. It's something of a crisis.\"\n\nThe team from Westminster University also spoke to the family of 35-year-old Kevin Eagles, who climbed up onto the roof of his Cross Heath flat while on monkey dust and staged a six-hour stand-off with police.\n\nHis mum Jane Eagles, who was moved to tears when discussing the importance of the work Baz Bailey does, said: \"The drug must turn them into some kind of demon. He's (Baz) been our rock.\"\n\nAlso featured is eanette Jackson, founder of Help for the Homeless, who regularly dishes out free meals and clothing to rough sleepers.\n\nIn the video, Jeanette explains: \"We have lost five this year - it's vile because it just eats them away. It's a man-made drug and they can't have anything to get them off it.\"\n\nThe film-makers also headed to the Portland Street area, where one resident showed a number of photographs she had taken of those under the influence, which she has sent to politicians to highlight how the drug is destroying their neighbourhood.\n\nShe said: \"I didn't want my children growing up with it. They shouldn't come out to play football and kick a couple of unconscious drug users because they were asleep in goals.\"\n\nDirector Alecia Kelter, from Chell Heath, is putting the documentary forward for festivals and has also been in touch with BBC Three.\n\nThe 20-year-old former Newcastle College student said: \"We found out what a big issue this was and it's a problem that seems to be getting worse. Most of the people have been through some horrible times to get to the position that they are in.\"\n\nProducer Connor Robinson, said the experience had been a real 'eye opener'. The 21-year-old, originally from Brighton, said: \"I hope the authorities watch it and see what is happening and will prompt some action.\"\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8Cancel Play now\n\nStaffordshire Police said a series of raids have been carried out as the force cracks down on the drug.\n\nChief Superintendent Jeff Moore, head of neighbourhood and partnerships, said: \"This is a complex issue and a range of enforcement activity is being undertaken by Staffordshire Police. This includes joint patrols with partner agencies to focus on the range of community issues, while also gathering intelligence and officers using stop and search powers to target those who they believe are involved in the use and supply of the drug.\n\n\"Across Stoke-on-Trent and Newcastle, police have executed a series of warrants for the supply of drugs with arrests and property recovered at these locations.\n\n\"Complementary activities working with partners in the city encourage the sharing of information and intelligence and help us to target dealers and engage with those individuals in need of additional support.\"\n\nRead More Stoke-on-Trent's monkey dust epidemic\n\nCouncillor Ann James, leader of Stoke-on-Trent City Council and cabinet member for health and social care, said a taskforce has been set up to tackle the problem.\n\nShe added: \"The aim is to ensure we co-ordinate our efforts to tackle the problems caused by novel psychoactive substances (which include those known as monkey dust) across Stoke-on-Trent and North Staffordshire.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8Cancel Play now\n\n\"As a result, we have been able to successfully disrupt the supply and sale of these substances and to offer help and support to people using these drugs, as well as family and other residents affected by it.\n\n\"We're pleased that the most recent statistics show the number of incidents that we're responding to is reducing. We are aware of the film from Westminster University, but this doesn't reflect the most up-to-date position.\"\n\nTo watch the documentary, click here.\n\nThe shocking court cases linked to monkey dust\n\nDrugged-up Shaun Dunn-Sweeny threatened to burn down his flat and kill 'pikeys' if the police did not arrest him.\n\nThe 52-year-old - who was high on monkey dust - went to the Smithfield 1 Building in Hanley and told officers he believed he had been poisoned and there was a 'hit out on his life'.\n\nHe threatened to set fire his flat if the officers did not lock him up and added he would get a gun and 'kill all the pikeys around here'.\n\nHe was detained and police found a bottle containing petrol among his possessions.\n\nDunn-Sweeny, below, of New Inn Lane, Hanford, pleaded guilty to threatening to damage or destroy property and failing to surrender to bail.\n\nHe was handed a 10-month jail sentence, suspended for 18 months, following the incident at midnight on April 14.\n\nJudge Dean Kershaw told the defendant: \"You are an example of the scourge that the drug, sometimes referred to a monkey dust, is having on society. It is an extremely dangerous drug. It is causing real havoc. It has caused havoc on your life.\"\n\nFore more on this story, click here.\n\nMonkey dust user Daniel Latham, below, threw a tin of paint on two pavements after threatening to buy petrol and burn down his flat and another building.\n\nThe 31-year-old attended the Hope Centre in Hanley in a paranoid state and claimed people were inside his flat and he wanted to go to the Harpfields Hospital.\n\nHe threatened to set fire to his home, the Hope Centre and vehicles.\n\nA few hours later the defendant was seen by police carrying a large tub of paint which he threw on the ground.\n\nOfficers tried to help him but he threw the paint down again near the Smithfield Building in Hanley causing it to spill.\n\nThe offences placed him in breach of a suspended jail sentence he received last August for inflicting grievous bodily harm and a battery.\n\nLatham, formerly of Linfield Road, Hanley, pleaded guilty to two offences of criminal damage, threatening to damage property and breaching a suspended sentence order.\n\nHe was handed a 12-month community order.\n\nFor more on this story, click here.\n\nDrugged-up Dean Hulme was 'probably high on monkey dust' when he pulled a knife on a shopper and his seven-month-old baby in a terrifying confrontation outside a busy supermarket - at 9am in the morning.\n\nThe 27-year-old, below, stole the knife from Sainsbury's, Stoke, before threatening his victim who feared for the life of his infant son in a shocking case of mistaken identity.\n\nHe was then pushed away before fleeing in the scene as he was chased by police.\n\nThe defendant - who was foaming from the mouth - only went to the floor after being threatened with a taser.\n\nHulme, of Frank Street, Stoke, pleaded guilty to affray, possession of a knife in public and failing to surrender to bail. He was jailed for 26 months.\n\nFor more on this story, click here.\n\nDrugged-up Kevin Eagles ripped tiles off the roof of a block of flats and hurled the 'missiles' to the ground - during a six-and-a-half hour police stand-off.\n\nThe paranoid 34-year-old, below, climbed onto the roof of the three-storey building and endangered the safety of passers-by after a monkey dust binge left him wrongly believing the police were chasing and harassing him.\n\nDamage was caused to the roof of the Aspire Housing-owned property, an unmarked police car and another vehicle during the incident which led to a section of Albemarle Road, in Cross Heath, being cordoned off.\n\nEagles, of Grove Street, Knutton - who has 34 previous convictions for 100 offences - pleaded guilty to affray and three offences of criminal damage and was jailed for 20 months.\n\nFor more on this story, click here.\n\nParanoid Peter Pointon attempted to seek refuge inside a police station because he thought a paedophile gang was after him - only to find the cop shop had closed down.\n\nThe 42-year-old then climbed onto the roof of Tunstall Police Station in a desperate attempt to get away from them.\n\nHe dislodged tiles which fell to the floor as he climbed onto the roof of the High Street station which closed down due to funding cuts three years ago.\n\nPolice rushed to the scene and the defendant immediately came down.\n\nDrugged-up Pointon, below, told police he was under the influence of a substance he had smoked - either monkey dust of black mamba - and believed a paedophile gang was after him.\n\nPointon, of City Road, Fenton, pleaded guilty to causing criminal damage. He was handed a 12-month conditional discharge.\n\nFor more on this story, click here.\n\nWant to tell us about something going on where you live? Let us know - Tweet us @SOTLive or message us on our Facebook page . And if you have pictures to share, tag us on Instagram at StokeonTrentLive.","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T05:06:00Z","eventUri":null,"image":"https://i2-prod.stokesentinel.co.uk/incoming/article2593565.ece/ALTERNATES/s1200/0_documentary1JPG.jpg","isDuplicate":false,"lang":"eng","sentiment":-0.1137254901960785,"sim":0,"source":{"dataType":"news","title":"Stoke Sentinel","uri":"stokesentinel.co.uk"},"time":"05:06:00","title":"'It turns them into demons' - First-hand accounts of monkey dust","uri":"1089851554","url":"https://www.stokesentinel.co.uk/news/stoke-on-trent-news/it-turns-kind-demon-fist-2591416","wgt":5},{"authors":[{"isAgency":false,"name":"Steve Nicholson","type":"author","uri":"steve_nicholson@derbytelegraph.co.uk"}],"body":"Get the biggest Weekday Derby County FC stories by emailSubscribeSee our privacy noticeMore newslettersThank you for subscribingWe have more newslettersShow meSee our privacy noticeCould not subscribe, try again laterInvalid Email\n\nDerby County are showing there is a pathway from the Academy to the first team, and manager Frank Lampard is delighted.\n\n\"I love it,\" said Lampard. \"It has been a real pleasure for me in my first year in management to see youth coming through. I am a huge advocate for giving players a chance if they are young, if they can show the ability to do it and the hunger to do it.\"\n\nJayden Mitchell-Lawson came off the bench to make his senior debut late on in Wednesday night's goalless draw against Stoke City in the Championship.\n\nThe 19-year-old winger has been catching the eye in the under-23s this season, and when he has stepped up to train with the first team.\n\nReaction: Derby County 0-0 Stoke City Live blog: Action & reaction Match report: Goalless draw at Pride Park In pictures: Gallery of action Senior debut: Who is Mitchell-Lawson? Player ratings: Bogle and Lawrence impress Frank Lampard: We should have won Video verdict: Steve Nicholson's take\n\nHe is one of five players with academy links to have played under Rams boss Lampard this season.\n\nMax Lowe started the campaign at left-back before he joined Aberdeen on loan. The 21-year-old returned in January and played two more games before he went back to Aberdeen, who he helped to beat Rangers 2-0 in a Scottish Cup quarter-final replay in front of 47,000 at Ibrox on Tuesday.\n\nMason Bennett has made 27 appearances under Lampard, 10 starts and 17 as a substitute. It is the most first-team games the 22-year-old has played in a season.\n\nEighteen-year-old midfielder Max Bird was an unused substitute against Stoke having made his first league start for the Rams in the recent game against Aston Villa at Villa Park.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8Cancel Play now\n\nThe shining light on the pathway is Jayden Bogle.\n\nYes, he signed for Derby from Swindon Town in January 2016 when he was 15 and at the same time as Mitchell-Lawson, but they have progressed in the Rams Academy.\n\nBogle, at 18, has established himself as the club's number one right back having started 37 of the 45 games in all competitions.\n\nHe is developing and learning his trade. There is, of course, work to be done with him, mostly defensively which is perhaps not a surprise given that he started as a winger.\n\nHis form has fluctuated during the season, as form of players and particularly young players tends to do, but his performance against Stoke was right up there with his best so far.\n\nLampard is full of praise for the way in which Bogle has taken to senior football and the manager plays down talk that selecting young players is a risk.\n\n\"Every selection is a risk, to a degree,\" said Lampard.\n\n\"When the players train and show what they can do, and play in the 23s or play for us, then the risk actually flips and becomes the opposite. It becomes an opportunity.\n\n\"When I came in, Jayden Bogle was not really spoken about, only within the club. He was seen as good young right back who had never touched the first team. Now you look at him and he has been a regular this season.\n\n\"It might have been a small risk the first game I put him in, but after that he has been great for us.\"\n\nCalum MacDonald, Tyree Wilson, Lee Buchanan and Luke Thomas, on loan at Coventry City currently, have all been on the bench for Derby this season.\n\nYoung players have to display the attributes, characteristics and quality to be handed an opportunity. Then they must take the chance and show they can cope.\n\n\"A football club should always be looking at its Academy and trying to integrate the young players and make pathways for them to get into the first team,\" said Lampard, who believes the pathway should be a selling point for the club.\n\n\"It is difficult now to recruit young players, everybody wants them, the best ones are wanted by a lot of the top clubs,\" Lampard added.\n\n\"We have to sell ourselves as being a club that takes good care of you, and we will do our best to make the most of the talent a young player may have.\n\nVideo Loading Video Unavailable Click to play Tap to play The video will start in 8Cancel Play now\n\n\"Secondly, if you work and want to buy into that, and the ethics of what it takes to work your way through, then we will give you an opportunity.\n\n\"I think we have shown that this season, and it is good for us to show that.\"\n\nBlooding young players is not straightforward when a team is in the mix for a top-six finish and possible promotion, as Derby find themselves with nine league matches to play. \"I would love to get them in there more, but it's a tough league,\" said Lampard.\n\nPart of Lampard's remit on taking the job was to reduce the average age of the team that had touched 30 at the end of last season.\n\nHe has achieved that, and it has been no mean achievement doing so while at the same time remaining competitive at the top end of the Championship.\n\nRead More For all your Derby County needs\n\nThe average age of the starting 11 against Stoke was 26. Five of the 11 are 25 or under before Marriott (24) and Mitchell-Lawson (19) came off the bench.\n\nYoung loanees Fikayo Tomori and Mason Mount from Chelsea, and Harry Wilson from Liverpool have been key figures. They have made 108 starts between them this season - Tomori 42, Wilson 34 and Mount 32.\n\n\"The loan boys, and they were young loans - 19, 20 and 21 when they came in - have been great to work with because they are sponges, they want to listen and they want to learn,\" said Lampard.\n\n\"I think they have all come through this loan period better for it.\"","dataType":"news","date":"2019-03-18","dateTime":"2019-03-18T05:02:00Z","eventUri":null,"image":"https://i2-prod.derbytelegraph.co.uk/incoming/article2643502.ece/ALTERNATES/s1200/0_Mitchell-Lawson.jpg","isDuplicate":false,"lang":"eng","sentiment":0.4509803921568627,"sim":0,"source":{"dataType":"news","title":"Derby Telegraph","uri":"derbytelegraph.co.uk"},"time":"05:02:00","title":"Frank Lampard giving hope to Derby County young guns","uri":"1089849712","url":"https://www.derbytelegraph.co.uk/sport/football/football-news/derby-county-academy-frank-lampard-2648936","wgt":5}]}
